prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
/*
 * SPDX-FileCopyrightText: 2026 M5Stack Technology CO LTD
 *
 * SPDX-License-Identifier: MIT
 */

#include "M5IOE1.h"
#include <string.h>
#include <inttypes.h>

static const char* TAG      = "M5IOE1";
static const char* TAG_I2C  = "M5IOE1_I2C";
static const char* TAG_GPIO = "M5IOE1_GPIO";
static const char* TAG_ADC  = "M5IOE1_ADC";
static const char* TAG_PWM  = "M5IOE1_PWM";
static const char* TAG_LED  = "M5IOE1_LED";
static const char* TAG_AMP  = "M5IOE1_AMP";
static const char* TAG_IRQ  = "M5IOE1_IRQ";
static const char* TAG_SYS  = "M5IOE1_SYS";

#ifdef ARDUINO
#include <Arduino.h>
#define M5IOE1_DELAY_MS(ms)  delay(ms)
#define M5IOE1_GET_TIME_MS() millis()

// Arduino 日志级别控制
// Arduino log level control
static m5ioe1_log_level_t _m5ioe1_log_level = M5IOE1_LOG_LEVEL_INFO;

#define M5IOE1_LOG_I(tag, fmt, ...)                                \
    do {                                                           \
        if (_m5ioe1_log_level >= M5IOE1_LOG_LEVEL_INFO) {          \
            log_printf("[I][%s] " fmt "\r\n", tag, ##__VA_ARGS__); \
        }                                                          \
    } while (0)

#define M5IOE1_LOG_W(tag, fmt, ...)                                \
    do {                                                           \
        if (_m5ioe1_log_level >= M5IOE1_LOG_LEVEL_WARN) {          \
            log_printf("[W][%s] " fmt "\r\n", tag, ##__VA_ARGS__); \
        }                                                          \
    } while (0)

#define M5IOE1_LOG_E(tag, fmt, ...)                                \
    do {                                                           \
        if (_m5ioe1_log_level >= M5IOE1_LOG_LEVEL_ERROR) {         \
            log_printf("[E][%s] " fmt "\r\n", tag, ##__VA_ARGS__); \
        }                                                          \
    } while (0)

#define M5IOE1_LOG_D(tag, fmt, ...)                                \
    do {                                                           \
        if (_m5ioe1_log_level >= M5IOE1_LOG_LEVEL_DEBUG) {         \
            log_printf("[D][%s] " fmt "\r\n", tag, ##__VA_ARGS__); \
        }                                                          \
    } while (0)

#define M5IOE1_LOG_V(tag, fmt, ...)                                \
    do {                                                           \
        if (_m5ioe1_log_level >= M5IOE1_LOG_LEVEL_VERBOSE) {       \
            log_printf("[V][%s] " fmt "\r\n", tag, ##__VA_ARGS__); \
        }                                                          \
    } while (0)

// (Arduino 轮询/中断任务句柄已移至实例成员 _pollTask，支持多实例)
// (Arduino polling/interrupt task handles moved to instance member _pollTask for multi-instance support)
#else
// 强制本组件编译所有级别的日志，实际输出由运行时的 esp_log_level_set 控制
// Force compile all log levels for this component; actual output controlled by esp_log_level_set at runtime
#ifndef LOG_LOCAL_LEVEL
#define LOG_LOCAL_LEVEL ESP_LOG_VERBOSE
#endif
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"
#include "driver/gpio.h"
#define M5IOE1_DELAY_MS(ms)         vTaskDelay(pdMS_TO_TICKS(ms))
#define M5IOE1_GET_TIME_MS()        (xTaskGetTickCount() * portTICK_PERIOD_MS)
#define M5IOE1_LOG_I(tag, fmt, ...) ESP_LOGI(tag, fmt, ##__VA_ARGS__)
#define M5IOE1_LOG_W(tag, fmt, ...) ESP_LOGW(tag, fmt, ##__VA_ARGS__)
#define M5IOE1_LOG_E(tag, fmt, ...) ESP_LOGE(tag, fmt, ##__VA_ARGS__)
#define M5IOE1_LOG_D(tag, fmt, ...) ESP_LOGD(tag, fmt, ##__VA_ARGS__)
#define M5IOE1_LOG_V(tag, fmt, ...) ESP_LOGV(tag, fmt, ##__VA_ARGS__)

// ESP-IDF 平台日志级别控制
// ESP-IDF platform log level control
static m5ioe1_log_level_t _m5ioe1_current_log_level = M5IOE1_LOG_LEVEL_INFO;
#endif

// ============================
// 全局日志级别控制
// Global Log Level Control
// ============================

void M5IOE1::setLogLevel(m5ioe1_log_level_t level)
{
#ifdef ARDUINO
    _m5ioe1_log_level = level;
#else
    _m5ioe1_current_log_level = level;

    // 将 M5IOE1 日志级别映射到 ESP-IDF 日志级别
    // Map M5IOE1 log level to ESP-IDF log level
    esp_log_level_t esp_level;
    switch (level) {
        case M5IOE1_LOG_LEVEL_NONE:
            esp_level = ESP_LOG_NONE;
            break;
        case M5IOE1_LOG_LEVEL_ERROR:
            esp_level = ESP_LOG_ERROR;
            break;
        case M5IOE1_LOG_LEVEL_WARN:
            esp_level = ESP_LOG_WARN;
            break;
        case M5IOE1_LOG_LEVEL_INFO:
            esp_level = ESP_LOG_INFO;
            break;
        case M5IOE1_LOG_LEVEL_DEBUG:
            esp_level = ESP_LOG_DEBUG;
            break;
        case M5IOE1_LOG_LEVEL_VERBOSE:
            esp_level = ESP_LOG_VERBOSE;
            break;
        default:
            esp_level = ESP_LOG_INFO;
            break;
    }

    esp_log_level_set(TAG, esp_level);
#endif
}

m5ioe1_log_level_t M5IOE1::getLogLevel()
{
#ifdef ARDUINO
    return _m5ioe1_log_level;
#else
    return _m5ioe1_current_log_level;
#endif
}

void M5IOE1::enableDefaultInterruptLog(bool enable)
{
    _enableDefaultIsrLog = enable;
}

// ============================
// 构造函数
// 析构函数
// ============================

M5IOE1::M5IOE1()
{
    _addr                = M5IOE1_DEFAULT_ADDR;
    _initialized         = false;
    _autoSnapshot        = true;
    _enableDefaultIsrLog = false;
    _requestedSpeed      = M5IOE1_I2C_FREQ_DEFAULT;
    _autoWakeEnabled     = false;
    _lastCommTime        = 0;
    _intMode             = M5IOE1_INT_MODE_DISABLED;
    _intPin              = -1;
    _pollingInterval     = 5000;
    _pinStatesValid      = false;
    _pwmStatesValid      = false;
    _pwmFrequency        = 0;
    _adcStateValid       = false;
    _i2cConfigValid      = false;

#ifdef ARDUINO
    _wire = nullptr;
    _sda  = 0;
    _scl  = 0;
#if M5IOE1_HAS_M5UNIFIED_I2C
    _m5_i2c   = nullptr;
    _commFreq = 0;
#endif
#else
    _i2cDriverType = M5IOE1_I2C_DRIVER_NONE;
#if M5IOE1_HAS_I2C_MASTER
    _i2c_master_bus = nullptr;
    _i2c_master_dev = nullptr;
#endif  // M5IOE1_HAS_I2C_MASTER
#if M5IOE1_HAS_I2C_BUS
    _i2c_bus    = nullptr;
    _i2c_device = nullptr;
#endif
    _busExternal = false;
    _sda         = -1;
    _scl         = -1;
    _port        = I2C_NUM_0;
    _intrQueue   = nullptr;
#if M5IOE1_HAS_M5UNIFIED_I2C
    _m5_i2c   = nullptr;
    _commFreq = M5IOE1_I2C_FREQ_100K;
#endif
#endif

    _pollTask = nullptr;

    memset(_callbacks, 0, sizeof(_callbacks));
    _clearPinStates();
    _clearPwmStates();
    _clearAdcState();
    _clearI2cConfig();
    _clearAw8737a();
}

M5IOE1::~M5IOE1()
{
#ifdef ARDUINO
    _cleanupPollingArduino();
    _cleanupHardwareInterruptArduino();
#else
    _cleanupPolling();
    _cleanupHardwareInterrupt();

