prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    // 根据驱动类型进行清理
    // Cleanup based on driver type
    switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
        case M5IOE1_I2C_DRIVER_SELF_CREATED:
            // 自创建：先删除设备，再删除总线
            // Self-created: delete device first, then bus
            if (_i2c_master_dev) {
                i2c_master_bus_rm_device(_i2c_master_dev);
                _i2c_master_dev = nullptr;
            }
            if (_i2c_master_bus) {
                i2c_del_master_bus(_i2c_master_bus);
                _i2c_master_bus = nullptr;
            }
            break;

        case M5IOE1_I2C_DRIVER_MASTER:
            // 外部 i2c_master：总是删除我们创建的设备句柄，但不删除总线
            // External i2c_master: always delete the device handle we created, but not the bus
            if (_i2c_master_dev) {
                i2c_master_bus_rm_device(_i2c_master_dev);
                _i2c_master_dev = nullptr;
            }
            break;
#endif  // M5IOE1_HAS_I2C_MASTER

#if M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_BUS:
            // 外部 i2c_bus：总是删除我们创建的设备句柄，但不删除总线
            // External i2c_bus: always delete the device handle we created, but not the bus
            if (_i2c_device) {
                i2c_bus_device_delete(&_i2c_device);
                _i2c_device = nullptr;
            }
            break;
#endif  // M5IOE1_HAS_I2C_BUS

#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_LEGACY:
            // Legacy I2C：如果是自创建则卸载驱动
            // Legacy I2C: uninstall driver if self-created
            if (!_busExternal) {
                i2c_driver_delete(_port);
            }
            break;
#endif  // !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS

        default:
            break;
    }
#endif
}

// ============================
// 初始化函数
// Initialization Functions
// ============================

#ifdef ARDUINO

m5ioe1_err_t M5IOE1::begin(TwoWire* wire, uint8_t addr, uint8_t sda, uint8_t scl, uint32_t speed, int8_t intPin,
                           m5ioe1_int_mode_t intMode)
{
    _wire   = wire;
    _addr   = addr;
    _sda    = sda;  // 保存 SDA 引脚用于 I2C 重新初始化
    _scl    = scl;  // 保存 SCL 引脚用于 I2C 重新初始化
    _intPin = intPin;

    if (intMode == M5IOE1_INT_MODE_HARDWARE && _intPin < 0) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 验证 I2C 频率 - M5IOE1 仅支持 100KHz 或 400KHz
    // Validate I2C frequency - M5IOE1 only supports 100KHz or 400KHz
    if (!_isValidI2cFrequency(speed)) {
        M5IOE1_LOG_W(TAG_I2C,
                     "Invalid I2C frequency: %" PRIu32
                     " Hz. M5IOE1 only supports 100KHz or 400KHz. Falling back to 100KHz.",
                     speed);
        _requestedSpeed = M5IOE1_I2C_FREQ_100K;
    } else {
        _requestedSpeed = speed;
    }

    // 始终以 100KHz 开始 - M5IOE1 在上电/复位后默认为 100KHz
    // Always start with 100KHz - M5IOE1 defaults to 100KHz after power-on/reset
    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (device default)");

    // 在开始新的 I2C 会话之前结束之前的会话（修复 ESP_ERR_INVALID_STATE）
    // End any previous I2C session before starting new one (fixes ESP_ERR_INVALID_STATE)
    // 注意：ESP32 Arduino Wire 库需要足够的延时
    // Note: ESP32 Arduino Wire library needs sufficient delay
    _wire->end();
    M5IOE1_DELAY_MS(50);

    // 初始化 I2C 总线并检查返回值
    // Initialize I2C bus and check return value
    if (!_wire->begin(sda, scl, M5IOE1_I2C_FREQ_100K)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to initialize I2C bus (SDA=%d, SCL=%d)", sda, scl);
        return M5IOE1_ERR_I2C_CONFIG;
    }

    // 给 I2C 总线时间在初始化后稳定
    // Give the I2C bus time to stabilize after initialization
    M5IOE1_DELAY_MS(100);

    // 使用地址解析流程：探测候选地址、REV 校验、完整初始化
    // Use address resolution: probe candidates, REV check, full init
    return _resolveAndInit(addr, intMode);
}

#if M5IOE1_HAS_M5UNIFIED_I2C
// =====================================================
// Type A (Arduino): M5Unified I2C_Class, no hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(m5::I2C_Class* i2c, uint8_t addr, uint32_t speed, m5ioe1_int_mode_t intMode)
{
    if (!i2c || !i2c->isEnabled()) {
        M5IOE1_LOG_E(TAG_I2C, "M5Unified I2C_Class not initialized");
        return M5IOE1_ERR_INVALID_ARG;
    }

    _wire   = nullptr;
    _m5_i2c = i2c;
    _addr   = addr;
    _sda    = 0;
    _scl    = 0;
    _intPin = -1;

    if (intMode == M5IOE1_INT_MODE_HARDWARE) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 验证 I2C 频率
    // Validate I2C frequency
    if (!_isValidI2cFrequency(speed)) {
        M5IOE1_LOG_W(TAG_I2C, "Invalid I2C frequency: %" PRIu32 " Hz. Falling back to 100KHz.", speed);
        _requestedSpeed = M5IOE1_I2C_FREQ_100K;
    } else {
        _requestedSpeed = speed;
    }

    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (device default)");

    // 步骤 1: 尝试唤醒设备（初始 100K）
    // Step 1: Wake device at initial 100K
    _commFreq = M5IOE1_I2C_FREQ_100K;

    // 使用地址解析流程：探测候选地址、REV 校验、完整初始化
    // Use address resolution: probe candidates, REV check, full init
    return _resolveAndInit(addr, intMode);
}

// =====================================================
// Type B (Arduino): M5Unified I2C_Class, with hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(m5::I2C_Class* i2c, uint8_t addr, uint32_t speed, int intPin, m5ioe1_int_mode_t intMode)
{
    m5ioe1_err_t err = begin(i2c, addr, speed, M5IOE1_INT_MODE_DISABLED);
    if (err != M5IOE1_OK) {
        return err;
    }

    _intPin = intPin;
    if (intMode == M5IOE1_INT_MODE_HARDWARE && _intPin < 0) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (intMode != M5IOE1_INT_MODE_DISABLED) {
        err = setInterruptMode(intMode);
        if (err != M5IOE1_OK) {
            _initialized = false;
            return err;
        }
    }
    return M5IOE1_OK;
}
#endif  // M5IOE1_HAS_M5UNIFIED_I2C

