prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
#else  // ESP-IDF

// =====================================================
// Type 1A: Self-created I2C bus, no hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(i2c_port_t port, uint8_t addr, int sda, int scl, uint32_t speed, m5ioe1_int_mode_t intMode)
{
    _addr        = addr;
    _busExternal = false;
#if M5IOE1_HAS_I2C_MASTER
    _i2cDriverType = M5IOE1_I2C_DRIVER_SELF_CREATED;
#else
    _i2cDriverType = M5IOE1_I2C_DRIVER_LEGACY;
#endif
    _intPin = -1;
    _port   = port;
    _sda    = sda;
    _scl    = scl;

    if (intMode == M5IOE1_INT_MODE_HARDWARE) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 验证 I2C 频率 - M5IOE1 仅支持 100KHz 或 400KHz
    // Validate I2C frequency - M5IOE1 only supports 100KHz or 400KHz
    if (!_isValidI2cFrequency(speed)) {
        M5IOE1_LOG_W(TAG_I2C,
                     "Invalid I2C frequency: %" PRIu32
                     " Hz. M5IOE1 only supports 100KHz or 400KHz. Falling back to 100KHz.",
                     speed);
        _requestedSpeed = M5IOE1_I2C_FREQ_100K;
    } else {
        _requestedSpeed = speed;
    }

#if M5IOE1_HAS_I2C_MASTER
    // 始终以 100KHz 开始 - M5IOE1 在上电/复位后默认为 100KHz
    // Always start with 100KHz - M5IOE1 defaults to 100KHz after power-on/reset
    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (device default)");

    // 使用 ESP-IDF 原生驱动创建 I2C 主总线
    // Create I2C master bus using ESP-IDF native driver
    i2c_master_bus_config_t bus_config = {
        .i2c_port          = port,
        .sda_io_num        = (gpio_num_t)sda,
        .scl_io_num        = (gpio_num_t)scl,
        .clk_source        = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .intr_priority     = 0,
        .trans_queue_depth = 0,
        .flags =
            {
                .enable_internal_pullup = true,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
                .allow_pd = false,
#endif
            },
    };

    esp_err_t ret = i2c_new_master_bus(&bus_config, &_i2c_master_bus);
    if (ret != ESP_OK) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to create I2C master bus: %s", esp_err_to_name(ret));
        return M5IOE1_ERR_I2C_CONFIG;
    }

    // 使用地址解析流程：探测候选地址、REV 校验、完整初始化
    // Use address resolution: probe candidates, REV check, full init
    m5ioe1_err_t res = _resolveAndInit(addr, intMode);
    if (res != M5IOE1_OK) {
        // 清理自创建的总线
        // Cleanup self-created bus on failure
        if (_i2c_master_dev) {
            i2c_master_bus_rm_device(_i2c_master_dev);
            _i2c_master_dev = nullptr;
        }
        i2c_del_master_bus(_i2c_master_bus);
        _i2c_master_bus = nullptr;
    }
    return res;

#else  // !M5IOE1_HAS_I2C_MASTER
    // Legacy API (IDF < 5.3.0)
    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (Legacy API, IDF < 5.3.0)");

    i2c_config_t i2c_conf     = {};
    i2c_conf.mode             = I2C_MODE_MASTER;
    i2c_conf.sda_io_num       = sda;
    i2c_conf.scl_io_num       = scl;
    i2c_conf.sda_pullup_en    = GPIO_PULLUP_ENABLE;
    i2c_conf.scl_pullup_en    = GPIO_PULLUP_ENABLE;
    i2c_conf.master.clk_speed = M5IOE1_I2C_FREQ_100K;

    esp_err_t ret = i2c_param_config(port, &i2c_conf);
    if (ret != ESP_OK) {
        M5IOE1_LOG_E(TAG_I2C, "i2c_param_config failed: %s", esp_err_to_name(ret));
        return M5IOE1_ERR_I2C_CONFIG;
    }

    ret = i2c_driver_install(port, I2C_MODE_MASTER, 0, 0, 0);
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        M5IOE1_LOG_E(TAG_I2C, "i2c_driver_install failed: %s", esp_err_to_name(ret));
        return M5IOE1_ERR_I2C_CONFIG;
    }

    // 使用地址解析流程
    // Use address resolution flow
    m5ioe1_err_t res = _resolveAndInit(addr, intMode);
    if (res != M5IOE1_OK && !_busExternal) {
        i2c_driver_delete(port);
    }
    return res;

#endif  // M5IOE1_HAS_I2C_MASTER
}

// =====================================================
// Type 1B: Self-created I2C bus, with hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(i2c_port_t port, uint8_t addr, int sda, int scl, uint32_t speed, int intPin,
                           m5ioe1_int_mode_t intMode)
{
    m5ioe1_err_t err = begin(port, addr, sda, scl, speed, M5IOE1_INT_MODE_DISABLED);
    if (err != M5IOE1_OK) {
        return err;
    }

    _intPin = intPin;
    if (intMode == M5IOE1_INT_MODE_HARDWARE && _intPin < 0) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (intMode != M5IOE1_INT_MODE_DISABLED) {
        err = setInterruptMode(intMode);
        if (err != M5IOE1_OK) {
            _initialized = false;
            return err;
        }
    }
    return M5IOE1_OK;
}

#if M5IOE1_HAS_I2C_MASTER
// =====================================================
// Type 2A: Existing i2c_master_bus_handle_t, no hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(i2c_master_bus_handle_t bus, uint8_t addr, uint32_t speed, m5ioe1_int_mode_t intMode)
{
    _addr           = addr;
    _busExternal    = true;
    _i2cDriverType  = M5IOE1_I2C_DRIVER_MASTER;
    _intPin         = -1;
    _i2c_master_bus = bus;
    _sda            = -1;  // 外部总线未知
                           // Unknown for external bus
    _scl = -1;

    if (intMode == M5IOE1_INT_MODE_HARDWARE) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 验证 I2C 频率
    // Validate I2C frequency
    if (!_isValidI2cFrequency(speed)) {
        M5IOE1_LOG_W(TAG_I2C, "Invalid I2C frequency: %" PRIu32 " Hz. Falling back to 100KHz.", speed);
        _requestedSpeed = M5IOE1_I2C_FREQ_100K;
    } else {
        _requestedSpeed = speed;
    }

    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (device default)");

    // 使用地址解析流程
    // Use address resolution flow
    m5ioe1_err_t res = _resolveAndInit(addr, intMode);
    if (res != M5IOE1_OK && _i2c_master_dev) {
        i2c_master_bus_rm_device(_i2c_master_dev);
        _i2c_master_dev = nullptr;
    }
    return res;
}

