prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
// =====================================================
// Type 2B: Existing i2c_master_bus_handle_t, with hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(i2c_master_bus_handle_t bus, uint8_t addr, uint32_t speed, int intPin,
                           m5ioe1_int_mode_t intMode)
{
    m5ioe1_err_t err = begin(bus, addr, speed, M5IOE1_INT_MODE_DISABLED);
    if (err != M5IOE1_OK) {
        return err;
    }

    _intPin = intPin;
    if (intMode == M5IOE1_INT_MODE_HARDWARE && _intPin < 0) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (intMode != M5IOE1_INT_MODE_DISABLED) {
        err = setInterruptMode(intMode);
        if (err != M5IOE1_OK) {
            _initialized = false;
            return err;
        }
    }
    return M5IOE1_OK;
}
#endif  // M5IOE1_HAS_I2C_MASTER

// =====================================================
// Type 3A: Existing i2c_bus_handle_t, no hardware interrupt
// =====================================================
#if M5IOE1_HAS_I2C_BUS
m5ioe1_err_t M5IOE1::begin(i2c_bus_handle_t bus, uint8_t addr, uint32_t speed, m5ioe1_int_mode_t intMode)
{
    _addr          = addr;
    _busExternal   = true;
    _i2cDriverType = M5IOE1_I2C_DRIVER_BUS;
    _intPin        = -1;
    _i2c_bus       = bus;
    _sda           = -1;  // 外部总线未知
                          // Unknown for external bus
    _scl = -1;

    if (intMode == M5IOE1_INT_MODE_HARDWARE) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 验证 I2C 频率
    // Validate I2C frequency
    if (!_isValidI2cFrequency(speed)) {
        M5IOE1_LOG_W(TAG_I2C, "Invalid I2C frequency: %" PRIu32 " Hz. Falling back to 100KHz.", speed);
        _requestedSpeed = M5IOE1_I2C_FREQ_100K;
    } else {
        _requestedSpeed = speed;
    }

    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (device default)");

    // 使用地址解析流程
    // Use address resolution flow
    m5ioe1_err_t res = _resolveAndInit(addr, intMode);
    if (res != M5IOE1_OK && _i2c_device) {
        i2c_bus_device_delete(&_i2c_device);
        _i2c_device = nullptr;
    }
    return res;
}

// =====================================================
// Type 3B: Existing i2c_bus_handle_t, with hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(i2c_bus_handle_t bus, uint8_t addr, uint32_t speed, int intPin, m5ioe1_int_mode_t intMode)
{
    m5ioe1_err_t err = begin(bus, addr, speed, M5IOE1_INT_MODE_DISABLED);
    if (err != M5IOE1_OK) {
        return err;
    }

    _intPin = intPin;
    if (intMode == M5IOE1_INT_MODE_HARDWARE && _intPin < 0) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (intMode != M5IOE1_INT_MODE_DISABLED) {
        err = setInterruptMode(intMode);
        if (err != M5IOE1_OK) {
            _initialized = false;
            return err;
        }
    }
    return M5IOE1_OK;
}

#endif  // M5IOE1_HAS_I2C_BUS

#if M5IOE1_HAS_M5UNIFIED_I2C
// =====================================================
// Type 4A: M5Unified I2C_Class, no hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(m5::I2C_Class* i2c, uint8_t addr, uint32_t speed, m5ioe1_int_mode_t intMode)
{
    if (!i2c || !i2c->isEnabled()) {
        M5IOE1_LOG_E(TAG_I2C, "M5Unified I2C_Class not initialized");
        return M5IOE1_ERR_INVALID_ARG;
    }

    _addr          = addr;
    _busExternal   = true;
    _i2cDriverType = M5IOE1_I2C_DRIVER_M5UNIFIED;
    _intPin        = -1;
    _m5_i2c        = i2c;
    _sda           = -1;
    _scl           = -1;

    if (intMode == M5IOE1_INT_MODE_HARDWARE) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 验证 I2C 频率
    // Validate I2C frequency
    if (!_isValidI2cFrequency(speed)) {
        M5IOE1_LOG_W(TAG_I2C, "Invalid I2C frequency: %" PRIu32 " Hz. Falling back to 100KHz.", speed);
        _requestedSpeed = M5IOE1_I2C_FREQ_100K;
    } else {
        _requestedSpeed = speed;
    }

    M5IOE1_LOG_I(TAG_I2C, "Initializing M5IOE1 with 100KHz (device default)");

    // 步骤 1: 设置初始通信频率
    // Step 1: Set initial communication frequency
    _commFreq = M5IOE1_I2C_FREQ_100K;

    // 使用地址解析流程
    // Use address resolution flow
    return _resolveAndInit(addr, intMode);
}

// =====================================================
// Type 4B: M5Unified I2C_Class, with hardware interrupt
// =====================================================
m5ioe1_err_t M5IOE1::begin(m5::I2C_Class* i2c, uint8_t addr, uint32_t speed, int intPin, m5ioe1_int_mode_t intMode)
{
    m5ioe1_err_t err = begin(i2c, addr, speed, M5IOE1_INT_MODE_DISABLED);
    if (err != M5IOE1_OK) {
        return err;
    }

    _intPin = intPin;
    if (intMode == M5IOE1_INT_MODE_HARDWARE && _intPin < 0) {
        M5IOE1_LOG_E(TAG_I2C, "Hardware interrupt mode requires interrupt pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (intMode != M5IOE1_INT_MODE_DISABLED) {
        err = setInterruptMode(intMode);
        if (err != M5IOE1_OK) {
            _initialized = false;
            return err;
        }
    }
    return M5IOE1_OK;
}
#endif  // M5IOE1_HAS_M5UNIFIED_I2C

#endif  // !ARDUINO

m5ioe1_err_t M5IOE1::setInterruptMode(m5ioe1_int_mode_t intMode, uint32_t pollingIntervalMs)
{
    const char* modeName = "UNKNOWN";
    if (intMode == M5IOE1_INT_MODE_DISABLED) {
        modeName = "DISABLED";
    } else if (intMode == M5IOE1_INT_MODE_POLLING) {
        modeName = "POLLING";
    } else if (intMode == M5IOE1_INT_MODE_HARDWARE) {
        modeName = "HARDWARE";
    }

    if (intMode == M5IOE1_INT_MODE_POLLING) {
        M5IOE1_LOG_I(TAG_IRQ, "Interrupt mode -> %s (pause if I2C sleep on; resume when off)", modeName);
    } else {
        M5IOE1_LOG_I(TAG_IRQ, "Interrupt mode -> %s", modeName);
    }

    _intMode         = intMode;
    _pollingInterval = pollingIntervalMs;

#ifdef ARDUINO
    _cleanupPollingArduino();
    _cleanupHardwareInterruptArduino();

    switch (intMode) {
        case M5IOE1_INT_MODE_POLLING:
            if (_i2cConfigValid && _i2cConfig.sleepTime > 0) {
                return M5IOE1_OK;
            }
            return _setupPollingArduino() ? M5IOE1_OK : M5IOE1_ERR_INTERNAL;
        case M5IOE1_INT_MODE_HARDWARE:
            return _setupHardwareInterruptArduino() ? M5IOE1_OK : M5IOE1_ERR_INTERNAL;
        default:
            break;
    }
#else
    _cleanupPolling();
    _cleanupHardwareInterrupt();

    switch (intMode) {
        case M5IOE1_INT_MODE_POLLING:
            if (_i2cConfigValid && _i2cConfig.sleepTime > 0) {
                return M5IOE1_OK;
            }
            return _setupPolling() ? M5IOE1_OK : M5IOE1_ERR_INTERNAL;
        case M5IOE1_INT_MODE_HARDWARE:
            return _setupHardwareInterrupt() ? M5IOE1_OK : M5IOE1_ERR_INTERNAL;
        default:
            break;
    }
#endif

