prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setPollingInterval(float seconds)
{
    if (seconds < 0.001f || seconds > 3600.0f) {
        M5IOE1_LOG_E(TAG_IRQ, "Invalid polling interval: %.3f seconds (valid range: 0.001-3600)", seconds);
        return M5IOE1_ERR_INVALID_ARG;
    }

    uint32_t intervalMs = (uint32_t)(seconds * 1000.0f);
    _pollingInterval    = intervalMs;

    // 如果当前处于轮询模式，使用新间隔重新启动
    // If currently in polling mode, restart with new interval
    if (_intMode == M5IOE1_INT_MODE_POLLING) {
#ifdef ARDUINO
        _cleanupPollingArduino();
        _cleanupHardwareInterruptArduino();
        if (_i2cConfigValid && _i2cConfig.sleepTime > 0) {
            return M5IOE1_OK;
        }
        return _setupPollingArduino() ? M5IOE1_OK : M5IOE1_ERR_INTERNAL;
#else
        _cleanupPolling();
        _cleanupHardwareInterrupt();
        if (_i2cConfigValid && _i2cConfig.sleepTime > 0) {
            return M5IOE1_OK;
        }
        return _setupPolling() ? M5IOE1_OK : M5IOE1_ERR_INTERNAL;
#endif
    }

    M5IOE1_LOG_I(TAG_IRQ, "Polling interval set to %.3f seconds (%u ms)", seconds, static_cast<unsigned>(intervalMs));
    return M5IOE1_OK;
}

// ============================
// 设备信息
// Device Information
// ============================

m5ioe1_err_t M5IOE1::getUID(uint16_t* uid)
{
    if (uid == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_UID_L, uid) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getVersion(uint8_t* version)
{
    if (version == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg(M5IOE1_REG_REV, version) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getRefVoltage(uint16_t* voltage_mv)
{
    if (voltage_mv == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_REF_VOLTAGE_L, voltage_mv) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

// ============================
// GPIO 功能
// GPIO Functions
// ============================

m5ioe1_err_t M5IOE1::_pinModeWithErr(uint8_t pin, uint8_t mode)
{
    if (!_isValidPin(pin)) {
        M5IOE1_LOG_E(TAG_GPIO, "Invalid pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_GPIO, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint16_t modeReg = 0, puReg = 0, pdReg = 0, drvReg = 0;

    M5IOE1_LOG_D(TAG_GPIO, "_pinModeWithErr: pin=%d mode=0x%02X", pin, mode);

    if (!_readReg16(M5IOE1_REG_GPIO_MODE_L, &modeReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_MODE register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_PU_L, &puReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_PU register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_PD_L, &pdReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_PD register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_DRV_L, &drvReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_DRV register");
        return M5IOE1_ERR_I2C_COMM;
    }

    switch (mode) {
        case INPUT:  // 0x01
            modeReg &= ~(1 << pin);
            puReg &= ~(1 << pin);
            pdReg &= ~(1 << pin);
            _pinStates[pin].isOutput = false;
            _pinStates[pin].pull     = 0;
            break;
        case PULLUP:        // 0x04 - 仅上拉
        case INPUT_PULLUP:  // 0x05
            modeReg &= ~(1 << pin);
            puReg |= (1 << pin);
            pdReg &= ~(1 << pin);
            _pinStates[pin].isOutput = false;
            _pinStates[pin].pull     = 1;
            break;
        case PULLDOWN:        // 0x08 - 仅下拉
        case INPUT_PULLDOWN:  // 0x09
            modeReg &= ~(1 << pin);
            puReg &= ~(1 << pin);
            pdReg |= (1 << pin);
            _pinStates[pin].isOutput = false;
            _pinStates[pin].pull     = 2;
            break;
        case OUTPUT:  // 0x03
            // 如果此引脚上启用了 PWM 则禁用
            // Disable PWM if enabled on this pin
            if (_isPwmPin(pin)) {
                uint8_t ch       = _getPwmChannel(pin);
                uint8_t regL     = M5IOE1_REG_PWM1_DUTY_L + ch * 2;
                uint16_t pwmData = 0;
                if (_readReg16(regL, &pwmData)) {
                    if (pwmData & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) {
                        pwmData &= ~((uint16_t)M5IOE1_PWM_ENABLE << 8);
                        _writeReg16(regL, pwmData);
                    }
                }
            }
            modeReg |= (1 << pin);
            puReg &= ~(1 << pin);
            pdReg &= ~(1 << pin);
            drvReg &= ~(1 << pin);  // 推挽
                                    // Push-pull
            _pinStates[pin].isOutput = true;
            _pinStates[pin].drive    = 0;
            break;
        case OPEN_DRAIN:         // 0x10
        case OUTPUT_OPEN_DRAIN:  // 0x13
            // 如果此引脚上启用了 PWM 则禁用
            // Disable PWM if enabled on this pin
            if (_isPwmPin(pin)) {
                uint8_t ch       = _getPwmChannel(pin);
                uint8_t regL     = M5IOE1_REG_PWM1_DUTY_L + ch * 2;
                uint16_t pwmData = 0;
                if (_readReg16(regL, &pwmData)) {
                    if (pwmData & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) {
                        pwmData &= ~((uint16_t)M5IOE1_PWM_ENABLE << 8);
                        _writeReg16(regL, pwmData);
                    }
                }
            }
            modeReg |= (1 << pin);
            puReg &= ~(1 << pin);
            pdReg &= ~(1 << pin);
            drvReg |= (1 << pin);  // 开漏
                                   // Open-drain
            _pinStates[pin].isOutput = true;
            _pinStates[pin].drive    = 1;
            break;
        case ANALOG:  // 0xC0
            // 模拟模式 - 设置为输入，无上拉下拉
            // Analog mode - set as input, no pull-up/down
            modeReg &= ~(1 << pin);
            puReg &= ~(1 << pin);
            pdReg &= ~(1 << pin);
            _pinStates[pin].isOutput = false;
            _pinStates[pin].pull     = 0;
            break;
        default:
            M5IOE1_LOG_E(TAG_GPIO, "Invalid mode: %d", mode);
            return M5IOE1_ERR_INVALID_ARG;
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write registers
    if (!_writeReg16(M5IOE1_REG_GPIO_PU_L, puReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_PU register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_PD_L, pdReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_PD register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_DRV_L, drvReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_DRV register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_MODE_L, modeReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_MODE register");
        return M5IOE1_ERR_I2C_COMM;
    }

