prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualPu = 0, actualPd = 0, actualDrv = 0, actualMode = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_PU_L, &actualPu)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_PU register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_PD_L, &actualPd)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_PD register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_DRV_L, &actualDrv)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_DRV register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_MODE_L, &actualMode)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_MODE register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    bool puMatch   = ((actualPu & (1 << pin)) == (puReg & (1 << pin)));
    bool pdMatch   = ((actualPd & (1 << pin)) == (pdReg & (1 << pin)));
    bool drvMatch  = ((actualDrv & (1 << pin)) == (drvReg & (1 << pin)));
    bool modeMatch = ((actualMode & (1 << pin)) == (modeReg & (1 << pin)));

    if (!puMatch || !pdMatch || !drvMatch || !modeMatch) {
        M5IOE1_LOG_E(TAG_GPIO, "Pin %d mode verification failed: PU=%c, PD=%c, DRV=%c, MODE=%c", pin,
                     puMatch ? 'Y' : 'N', pdMatch ? 'Y' : 'N', drvMatch ? 'Y' : 'N', modeMatch ? 'Y' : 'N');
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_GPIO);

    const char* modeName = (mode == INPUT)               ? "INPUT"
                           : (mode == OUTPUT)            ? "OUTPUT"
                           : (mode == INPUT_PULLUP)      ? "INPUT_PULLUP"
                           : (mode == INPUT_PULLDOWN)    ? "INPUT_PULLDOWN"
                           : (mode == OPEN_DRAIN)        ? "OPEN_DRAIN"
                           : (mode == OUTPUT_OPEN_DRAIN) ? "OUTPUT_OPEN_DRAIN"
                                                         : "UNKNOWN";
    M5IOE1_LOG_I(TAG_GPIO, "Pin %d mode set and verified: %s (0x%02X)", pin, modeName, mode);
    return M5IOE1_OK;
}

void M5IOE1::pinMode(uint8_t pin, uint8_t mode)
{
    (void)_pinModeWithErr(pin, mode);
}

void M5IOE1::pinModeWithRes(uint8_t pin, uint8_t mode, m5ioe1_err_t* err)
{
    if (err == nullptr) {
        M5IOE1_LOG_E(TAG_GPIO, "pinModeWithRes err is null");
        return;
    }
    *err = _pinModeWithErr(pin, mode);
}

m5ioe1_err_t M5IOE1::_digitalWriteWithErr(uint8_t pin, uint8_t value)
{
    if (!_isValidPin(pin)) {
        M5IOE1_LOG_E(TAG_GPIO, "Invalid pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_GPIO, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint16_t outReg = 0;
    M5IOE1_LOG_D(TAG_GPIO, "_digitalWriteWithErr: pin=%d val=%d", pin, value);
    if (!_readReg16(M5IOE1_REG_GPIO_OUT_L, &outReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_OUT register");
        return M5IOE1_ERR_I2C_COMM;
    }

    if (value) {
        outReg |= (1 << pin);
    } else {
        outReg &= ~(1 << pin);
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg16(M5IOE1_REG_GPIO_OUT_L, outReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_OUT register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualOut = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_OUT_L, &actualOut)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_OUT register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    bool outMatch = ((actualOut & (1 << pin)) == (outReg & (1 << pin)));

    if (!outMatch) {
        M5IOE1_LOG_E(TAG_GPIO, "Pin %d write verification failed: expected %d, actual %d", pin, value ? HIGH : LOW,
                     (actualOut & (1 << pin)) ? HIGH : LOW);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _pinStates[pin].outputLevel = value ? 1 : 0;

    // 步骤 5: 打印日志
    // Step 5: Log
    M5IOE1_LOG_I(TAG_GPIO, "Pin %d digital write and verified: %d", pin, value ? HIGH : LOW);

    return M5IOE1_OK;
}

void M5IOE1::digitalWrite(uint8_t pin, uint8_t value)
{
    (void)_digitalWriteWithErr(pin, value);
}

void M5IOE1::digitalWriteWithRes(uint8_t pin, uint8_t value, m5ioe1_err_t* err)
{
    if (err == nullptr) {
        M5IOE1_LOG_E(TAG_GPIO, "digitalWriteWithRes err is null");
        return;
    }
    *err = _digitalWriteWithErr(pin, value);
}

m5ioe1_err_t M5IOE1::_digitalReadWithErr(uint8_t pin, int* value)
{
    if (value == nullptr) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_isValidPin(pin)) {
        M5IOE1_LOG_E(TAG_GPIO, "Invalid pin");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_GPIO, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint16_t inReg = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_IN_L, &inReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_IN register");
        return M5IOE1_ERR_I2C_COMM;
    }

    *value = (inReg & (1 << pin)) ? HIGH : LOW;
    M5IOE1_LOG_D(TAG_GPIO, "_digitalReadWithErr: pin=%d -> %d", pin, *value);
    return M5IOE1_OK;
}

int M5IOE1::digitalRead(uint8_t pin)
{
    int value = -1;
    if (_digitalReadWithErr(pin, &value) != M5IOE1_OK) {
        return -1;
    }
    return value;
}

int M5IOE1::digitalReadWithRes(uint8_t pin, m5ioe1_err_t* err)
{
    if (err == nullptr) {
        M5IOE1_LOG_E(TAG_GPIO, "digitalReadWithRes err is null");
        return -1;
    }

    int value = -1;
    *err      = _digitalReadWithErr(pin, &value);
    return value;
}

// ============================
// 高级 GPIO 功能
// Advanced GPIO Functions
// ============================

m5ioe1_err_t M5IOE1::setPullMode(uint8_t pin, uint8_t pullMode)
{
    if (!_isValidPin(pin)) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_FAIL;

    M5IOE1_LOG_D(TAG_GPIO, "setPullMode: pin=%d pull=%d", pin, pullMode);

