prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    uint16_t puReg = 0, pdReg = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_PU_L, &puReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_PU register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_PD_L, &pdReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_PD register");
        return M5IOE1_ERR_I2C_COMM;
    }

    puReg &= ~(1 << pin);
    pdReg &= ~(1 << pin);

    if (pullMode == M5IOE1_PULL_UP) {
        puReg |= (1 << pin);
        _pinStates[pin].pull = 1;
    } else if (pullMode == M5IOE1_PULL_DOWN) {
        pdReg |= (1 << pin);
        _pinStates[pin].pull = 2;
    } else {
        _pinStates[pin].pull = 0;
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write registers
    if (!_writeReg16(M5IOE1_REG_GPIO_PU_L, puReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_PU register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_PD_L, pdReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_PD register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualPu = 0, actualPd = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_PU_L, &actualPu)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_PU register");
        return M5IOE1_ERR_I2C_COMM;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_PD_L, &actualPd)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_PD register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    bool puMatch = ((actualPu & (1 << pin)) == (puReg & (1 << pin)));
    bool pdMatch = ((actualPd & (1 << pin)) == (pdReg & (1 << pin)));

    if (!puMatch || !pdMatch) {
        M5IOE1_LOG_E(TAG_GPIO, "Pin %d pull mode verification failed: PU=%c, PD=%c", pin, puMatch ? 'Y' : 'N',
                     pdMatch ? 'Y' : 'N');
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_GPIO);

    const char* pullName = (pullMode == M5IOE1_PULL_NONE)   ? "NONE"
                           : (pullMode == M5IOE1_PULL_UP)   ? "PULL_UP"
                           : (pullMode == M5IOE1_PULL_DOWN) ? "PULL_DOWN"
                                                            : "UNKNOWN";
    M5IOE1_LOG_I(TAG_GPIO, "Pin %d pull mode set and verified: %s", pin, pullName);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setDriveMode(uint8_t pin, uint8_t driveMode)
{
    if (!_isValidPin(pin)) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_FAIL;

    M5IOE1_LOG_D(TAG_GPIO, "setDriveMode: pin=%d drive=%d", pin, driveMode);

    uint16_t drvReg = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_DRV_L, &drvReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read GPIO_DRV register");
        return M5IOE1_ERR_I2C_COMM;
    }

    if (driveMode == M5IOE1_DRIVE_OPENDRAIN) {
        drvReg |= (1 << pin);
        _pinStates[pin].drive = 1;
    } else {
        drvReg &= ~(1 << pin);
        _pinStates[pin].drive = 0;
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg16(M5IOE1_REG_GPIO_DRV_L, drvReg)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to write GPIO_DRV register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualDrv = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_DRV_L, &actualDrv)) {
        M5IOE1_LOG_E(TAG_GPIO, "Failed to read back GPIO_DRV register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    bool drvMatch = ((actualDrv & (1 << pin)) == (drvReg & (1 << pin)));

    if (!drvMatch) {
        M5IOE1_LOG_E(TAG_GPIO, "Pin %d drive mode verification failed: DRV=%c", pin, drvMatch ? 'Y' : 'N');
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_GPIO);

    M5IOE1_LOG_I(TAG_GPIO, "Pin %d drive mode set and verified: %s", pin,
                 (driveMode == M5IOE1_DRIVE_OPENDRAIN) ? "OpenDrain" : "PushPull");
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getInputState(uint8_t pin, uint8_t* state)
{
    if (!_isValidPin(pin)) return M5IOE1_ERR_INVALID_ARG;
    if (state == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_FAIL;

    int val = digitalRead(pin);
    if (val < 0) return M5IOE1_ERR_I2C_COMM;

    *state = (uint8_t)val;
    return M5IOE1_OK;
}

// ============================
// 中断功能
// Interrupt Functions
// ============================

void M5IOE1::attachInterrupt(uint8_t pin, m5ioe1_callback_t callback, uint8_t mode)
{
    if (!_isValidPin(pin) || callback == nullptr || !_initialized) return;

    // 检查冲突的中断
    // Check for conflicting interrupts
    if (_hasConflictingInterrupt(pin)) {
        M5IOE1_LOG_E(TAG_IRQ, "Interrupt conflict on pin %d", pin);
        return;
    }

    _callbacks[pin].callback    = callback;
    _callbacks[pin].callbackArg = nullptr;
    _callbacks[pin].arg         = nullptr;
    _callbacks[pin].enabled     = true;
    _callbacks[pin].rising      = (mode == RISING);

    // 将引脚配置为输入
    // Configure pin as input
    uint16_t modeReg = 0;
    _readReg16(M5IOE1_REG_GPIO_MODE_L, &modeReg);
    modeReg &= ~(1 << pin);

    // 步骤 1: 写入 GPIO_MODE 寄存器
    // Step 1: Write GPIO_MODE register
    if (!_writeReg16(M5IOE1_REG_GPIO_MODE_L, modeReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_MODE register for interrupt");
        return;
    }

    // 配置中断
    // Configure interrupt
    uint16_t ieReg = 0, itReg = 0;
    _readReg16(M5IOE1_REG_GPIO_IE_L, &ieReg);
    _readReg16(M5IOE1_REG_GPIO_IP_L, &itReg);

    ieReg |= (1 << pin);
    if (mode == RISING) {
        itReg |= (1 << pin);
    } else {
        itReg &= ~(1 << pin);
    }

    // 步骤 2: 写入中断寄存器
    // Step 2: Write interrupt registers
    if (!_writeReg16(M5IOE1_REG_GPIO_IE_L, ieReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IE register");
        return;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_IP_L, itReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IP register");
        return;
    }

