prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    // 步骤 3: 回读验证
    // Step 3: Read-back verification
    uint16_t actualMode = 0, actualIe = 0, actualIt = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_MODE_L, &actualMode)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_MODE register");
        return;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_IE_L, &actualIe)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_IE register");
        return;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_IP_L, &actualIt)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_IP register");
        return;
    }

    // 步骤 4: 验证关键位是否匹配
    // Step 4: Verify critical bits match
    bool modeMatch = ((actualMode & (1 << pin)) == 0);                   // 输入模式
    bool ieMatch   = ((actualIe & (1 << pin)) != 0);                     // 中断使能
    bool itMatch   = ((actualIt & (1 << pin)) == (itReg & (1 << pin)));  // 触发方式

    if (!modeMatch || !ieMatch || !itMatch) {
        M5IOE1_LOG_E(TAG_IRQ, "Pin %d interrupt verification failed: MODE=%c, IE=%c, IT=%c", pin, modeMatch ? 'Y' : 'N',
                     ieMatch ? 'Y' : 'N', itMatch ? 'Y' : 'N');
        return;
    }

    // 步骤 5: 验证成功，更新缓存
    // Step 5: Verification passed, update cache
    _pinStates[pin].intrEnabled = true;
    _pinStates[pin].intrRising  = (mode == RISING);

    M5IOE1_LOG_I(TAG_IRQ, "Pin %d interrupt attached and verified: mode=%s", pin,
                 mode == RISING ? "RISING" : "FALLING");
}

void M5IOE1::attachInterruptArg(uint8_t pin, m5ioe1_callback_arg_t callback, void* arg, uint8_t mode)
{
    if (!_isValidPin(pin) || callback == nullptr || !_initialized) return;

    if (_hasConflictingInterrupt(pin)) {
        M5IOE1_LOG_E(TAG_IRQ, "Interrupt conflict on pin %d", pin);
        return;
    }

    _callbacks[pin].callback    = nullptr;
    _callbacks[pin].callbackArg = callback;
    _callbacks[pin].arg         = arg;
    _callbacks[pin].enabled     = true;
    _callbacks[pin].rising      = (mode == RISING);

    // 将引脚配置为输入
    // Configure pin as input
    uint16_t modeReg = 0;
    _readReg16(M5IOE1_REG_GPIO_MODE_L, &modeReg);
    modeReg &= ~(1 << pin);

    // 配置中断
    // Configure interrupt
    uint16_t ieReg = 0, itReg = 0;
    _readReg16(M5IOE1_REG_GPIO_IE_L, &ieReg);
    _readReg16(M5IOE1_REG_GPIO_IP_L, &itReg);

    ieReg |= (1 << pin);
    if (mode == RISING) {
        itReg |= (1 << pin);
    } else {
        itReg &= ~(1 << pin);
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write registers
    if (!_writeReg16(M5IOE1_REG_GPIO_MODE_L, modeReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_MODE register");
        return;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_IE_L, ieReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IE register");
        return;
    }
    if (!_writeReg16(M5IOE1_REG_GPIO_IP_L, itReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IP register");
        return;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualMode = 0, actualIe = 0, actualIt = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_MODE_L, &actualMode)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_MODE register");
        return;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_IE_L, &actualIe)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_IE register");
        return;
    }
    if (!_readReg16(M5IOE1_REG_GPIO_IP_L, &actualIt)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_IP register");
        return;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    bool modeMatch = ((actualMode & (1 << pin)) == 0);                   // 输入模式
    bool ieMatch   = ((actualIe & (1 << pin)) != 0);                     // 中断使能
    bool itMatch   = ((actualIt & (1 << pin)) == (itReg & (1 << pin)));  // 触发方式

    if (!modeMatch || !ieMatch || !itMatch) {
        M5IOE1_LOG_E(TAG_IRQ, "Pin %d interrupt verification failed: MODE=%c, IE=%c, IT=%c", pin, modeMatch ? 'Y' : 'N',
                     ieMatch ? 'Y' : 'N', itMatch ? 'Y' : 'N');
        return;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _pinStates[pin].intrEnabled = true;
    _pinStates[pin].intrRising  = (mode == RISING);

    M5IOE1_LOG_I(TAG_IRQ, "Pin %d interrupt attached and verified: mode=%s", pin,
                 mode == RISING ? "RISING" : "FALLING");
}

void M5IOE1::detachInterrupt(uint8_t pin)
{
    if (!_isValidPin(pin) || !_initialized) return;

    uint16_t ieReg = 0;
    _readReg16(M5IOE1_REG_GPIO_IE_L, &ieReg);
    ieReg &= ~(1 << pin);

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg16(M5IOE1_REG_GPIO_IE_L, ieReg)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IE register for detach");
        return;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualIe = 0;
    if (!_readReg16(M5IOE1_REG_GPIO_IE_L, &actualIe)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to read back GPIO_IE register for detach");
        return;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    bool ieMatch = ((actualIe & (1 << pin)) == 0);  // 中断已禁用

    if (!ieMatch) {
        M5IOE1_LOG_E(TAG_IRQ, "Pin %d interrupt detach verification failed: IE=%c", pin, ieMatch ? 'Y' : 'N');
        return;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _callbacks[pin].callback    = nullptr;
    _callbacks[pin].callbackArg = nullptr;
    _callbacks[pin].arg         = nullptr;
    _callbacks[pin].enabled     = false;
    _pinStates[pin].intrEnabled = false;

    M5IOE1_LOG_I(TAG_IRQ, "Pin %d interrupt detached and verified", pin);
}

void M5IOE1::enableInterrupt(uint8_t pin)
{
    if (!_isValidPin(pin)) return;
    _callbacks[pin].enabled = true;
}

void M5IOE1::disableInterrupt(uint8_t pin)
{
    if (!_isValidPin(pin)) return;
    _callbacks[pin].enabled = false;
}

m5ioe1_err_t M5IOE1::getInterruptStatus(uint16_t* status)
{
    if (status == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_FAIL;

