prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    if (!_readReg16(M5IOE1_REG_GPIO_IS_L, status)) {
        return M5IOE1_ERR_I2C_COMM;
    }
    M5IOE1_LOG_D(TAG_IRQ, "IRQ status: 0x%04X", *status);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::clearInterrupt()
{
    if (!_initialized) return M5IOE1_FAIL;

    // GPIO_IS 寄存器是"写0清除"语义，必须写入0来清除所有中断
    // GPIO_IS register uses "write 0 to clear" semantics, must write 0 to clear all interrupts
    if (!_writeReg16(M5IOE1_REG_GPIO_IS_L, 0)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IS register for clear");
        return M5IOE1_ERR_I2C_COMM;
    }

    M5IOE1_LOG_I(TAG_IRQ, "Interrupt cleared (all pins)");
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::clearInterrupt(uint8_t pin)
{
    if (!_initialized) return M5IOE1_FAIL;
    if (pin >= M5IOE1_MAX_GPIO_PINS) {
        M5IOE1_LOG_E(TAG_IRQ, "Invalid pin: %d", pin);
        return M5IOE1_ERR_INVALID_ARG;
    }

    // GPIO_IS 寄存器为"写 0 清除"语义：写 0 清除对应位，写 1 不影响
    // GPIO_IS register uses "write 0 to clear" semantics: write 0 clears the bit, write 1 has no effect
    uint16_t mask = ~(1U << pin) & 0xFFFF;
    if (!_writeReg16(M5IOE1_REG_GPIO_IS_L, mask)) {
        M5IOE1_LOG_E(TAG_IRQ, "Failed to write GPIO_IS register for pin %d", pin);
        return M5IOE1_ERR_I2C_COMM;
    }

    M5IOE1_LOG_I(TAG_IRQ, "Interrupt cleared (pin %d)", pin);
    return M5IOE1_OK;
}

// ============================
// ADC 功能
// ADC Functions
// ============================

m5ioe1_err_t M5IOE1::analogRead(uint8_t channel, uint16_t* result)
{
    if (result == nullptr) {
        M5IOE1_LOG_E(TAG_ADC, "analogRead result is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (channel < 1 || channel > 4) {
        M5IOE1_LOG_E(TAG_ADC, "Invalid ADC channel: %d", channel);
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_ADC, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    // 开始转换
    // Start conversion
    uint8_t ctrl = (channel & M5IOE1_ADC_CH_MASK) | M5IOE1_ADC_START;
    if (!_writeReg(M5IOE1_REG_ADC_CTRL, ctrl)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to write ADC_CTRL register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 等待完成
    // Wait for completion
    uint8_t reg = 0;
    int tries   = 0;
    do {
        M5IOE1_DELAY_MS(1);
        if (!_readReg(M5IOE1_REG_ADC_CTRL, &reg)) {
            M5IOE1_LOG_E(TAG_ADC, "Failed to read ADC_CTRL register");
            return M5IOE1_ERR_I2C_COMM;
        }
        M5IOE1_LOG_V(TAG_ADC, "ADC ch%d waiting... tries=%d status=0x%02X", channel, tries, reg);
        tries++;
    } while ((reg & M5IOE1_ADC_BUSY) && tries < 20);

    if (reg & M5IOE1_ADC_BUSY) {
        M5IOE1_LOG_E(TAG_ADC, "ADC conversion timeout on channel %d", channel);
        return M5IOE1_ERR_TIMEOUT;
    }

    if (!_readReg16(M5IOE1_REG_ADC_DATA_L, result)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to read ADC_DATA register");
        return M5IOE1_ERR_I2C_COMM;
    }
    M5IOE1_LOG_D(TAG_ADC, "ADC ch%d: raw=%u (tries=%d)", channel, *result, tries);
    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_ADC);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::isAdcBusy(bool* busy)
{
    if (busy == nullptr) {
        M5IOE1_LOG_E(TAG_ADC, "isAdcBusy busy is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_ADC, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t ctrl = 0;
    if (!_readReg(M5IOE1_REG_ADC_CTRL, &ctrl)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to read ADC_CTRL register");
        return M5IOE1_ERR_I2C_COMM;
    }

    *busy = (ctrl & M5IOE1_ADC_BUSY) != 0;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::disableAdc()
{
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_ADC_CTRL, 0)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to write ADC_CTRL register for disable");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCtrl = 0;
    if (!_readReg(M5IOE1_REG_ADC_CTRL, &actualCtrl)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to read back ADC_CTRL register for disable");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    // START/BUSY 位应该清零，通道位也应该为 0
    // START/BUSY bits should be cleared, channel bits should also be 0
    if (actualCtrl != 0) {
        M5IOE1_LOG_E(TAG_ADC, "ADC disable verification failed: expected=0, actual=0x%02X", actualCtrl);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_ADC);

    M5IOE1_LOG_I(TAG_ADC, "ADC disabled and verified");
    return M5IOE1_OK;
}

// ============================
// 温度传感器
// Temperature Sensor
// ============================

m5ioe1_err_t M5IOE1::readTemperature(uint16_t* temperature)
{
    if (temperature == nullptr) {
        M5IOE1_LOG_E(TAG_ADC, "readTemperature temperature is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_ADC, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    if (!_writeReg(M5IOE1_REG_TEMP_CTRL, M5IOE1_TEMP_START)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to write TEMP_CTRL register");
        return M5IOE1_ERR_I2C_COMM;
    }

    uint8_t ctrl = 0;
    int tries    = 0;
    do {
        M5IOE1_DELAY_MS(1);
        if (!_readReg(M5IOE1_REG_TEMP_CTRL, &ctrl)) {
            M5IOE1_LOG_E(TAG_ADC, "Failed to read TEMP_CTRL register");
            return M5IOE1_ERR_I2C_COMM;
        }
        tries++;
    } while ((ctrl & M5IOE1_TEMP_BUSY) && tries < 20);

    if (ctrl & M5IOE1_TEMP_BUSY) {
        M5IOE1_LOG_E(TAG_ADC, "Temperature conversion timeout");
        return M5IOE1_ERR_TIMEOUT;
    }

    if (!_readReg16(M5IOE1_REG_TEMP_DATA_L, temperature)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to read TEMP_DATA register");
        return M5IOE1_ERR_I2C_COMM;
    }
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::isTemperatureBusy(bool* busy)
{
    if (busy == nullptr) {
        M5IOE1_LOG_E(TAG_ADC, "isTemperatureBusy busy is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_ADC, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t ctrl = 0;
    if (!_readReg(M5IOE1_REG_TEMP_CTRL, &ctrl)) {
        M5IOE1_LOG_E(TAG_ADC, "Failed to read TEMP_CTRL register");
        return M5IOE1_ERR_I2C_COMM;
    }

    *busy = (ctrl & M5IOE1_TEMP_BUSY) != 0;
    return M5IOE1_OK;
}

// ============================
// PWM 功能
// PWM Functions
// ============================

