prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
m5ioe1_err_t M5IOE1::setPwmFrequency(uint16_t frequency)
{
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    M5IOE1_LOG_D(TAG_PWM, "setPwmFrequency: %d Hz", frequency);

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg16(M5IOE1_REG_PWM_FREQ_L, frequency)) {
        M5IOE1_LOG_E(TAG_PWM, "Failed to write PWM_FREQ register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualFreq = 0;
    if (!_readReg16(M5IOE1_REG_PWM_FREQ_L, &actualFreq)) {
        M5IOE1_LOG_E(TAG_PWM, "Failed to read back PWM_FREQ register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    if (actualFreq != frequency) {
        M5IOE1_LOG_E(TAG_PWM, "PWM frequency verification failed: expected=%d, actual=%d", frequency, actualFreq);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _pwmFrequency = frequency;
    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_PWM);

    M5IOE1_LOG_I(TAG_PWM, "PWM frequency set and verified: %d Hz", frequency);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getPwmFrequency(uint16_t* frequency)
{
    if (frequency == nullptr) {
        M5IOE1_LOG_E(TAG_PWM, "getPwmFrequency frequency is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_PWM, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    if (!_readReg16(M5IOE1_REG_PWM_FREQ_L, frequency)) {
        M5IOE1_LOG_E(TAG_PWM, "Failed to read PWM_FREQ register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 更新缓存
    // Update cache
    _pwmFrequency = *frequency;

    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setPwmDuty(uint8_t channel, uint8_t duty, bool polarity, bool enable)
{
    if (channel > 3 || duty > 100) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    // 将百分比转换为 12 位 (0-4095)
    // Convert percentage to 12-bit (0-4095)
    uint16_t duty12 = (uint16_t)((duty * 0x0FFF) / 100);
    return setPwmDuty12bit(channel, duty12, polarity, enable);
}

m5ioe1_err_t M5IOE1::getPwmDuty(uint8_t channel, uint8_t* duty, bool* polarity, bool* enable)
{
    if (channel > 3) {
        M5IOE1_LOG_E(TAG_PWM, "Invalid PWM channel: %d", channel);
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (duty == nullptr || polarity == nullptr || enable == nullptr) {
        M5IOE1_LOG_E(TAG_PWM, "getPwmDuty output pointer is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_PWM, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t regL  = M5IOE1_REG_PWM1_DUTY_L + (channel * 2);
    uint16_t data = 0;
    if (!_readReg16(regL, &data)) {
        M5IOE1_LOG_E(TAG_PWM, "Failed to read PWM channel %d duty register", channel);
        return M5IOE1_ERR_I2C_COMM;
    }

    uint16_t duty12 = data & 0x0FFF;
    *duty           = (uint8_t)((duty12 * 100) / 0x0FFF);
    *polarity       = (data & ((uint16_t)M5IOE1_PWM_POLARITY << 8)) != 0;
    *enable         = (data & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) != 0;

    // 更新缓存
    // Update cache
    _pwmStates[channel].duty12   = duty12;
    _pwmStates[channel].polarity = *polarity;
    _pwmStates[channel].enabled  = *enable;

    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setPwmDuty12bit(uint8_t channel, uint16_t duty12, bool polarity, bool enable)
{
    if (channel > 3 || duty12 > 0x0FFF) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    M5IOE1_LOG_D(TAG_PWM, "setPwmDuty12bit: ch=%d duty=%d pol=%s en=%s", channel, duty12, polarity ? "Inv" : "Norm",
                 enable ? "On" : "Off");

    // 获取对应的引脚
    // Get corresponding pin
    uint8_t pin = (channel == 0) ? 8 : (channel == 1) ? 7 : (channel == 2) ? 10 : 9;

    uint8_t regL = M5IOE1_REG_PWM1_DUTY_L + (channel * 2);

    uint8_t dataL = (uint8_t)(duty12 & 0xFF);
    uint8_t dataH = (uint8_t)((duty12 >> 8) & 0x0F);
    if (polarity) dataH |= M5IOE1_PWM_POLARITY;
    if (enable) dataH |= M5IOE1_PWM_ENABLE;

    uint8_t buf[2] = {dataL, dataH};

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeBytes(regL, buf, 2)) {
        M5IOE1_LOG_E(TAG_PWM, "Failed to write PWM channel %d duty register", channel);
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualData = 0;
    if (!_readReg16(regL, &actualData)) {
        M5IOE1_LOG_E(TAG_PWM, "Failed to read back PWM channel %d duty register", channel);
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    uint16_t actualDuty12 = actualData & 0x0FFF;
    bool actualPolarity   = (actualData & ((uint16_t)M5IOE1_PWM_POLARITY << 8)) != 0;
    bool actualEnable     = (actualData & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) != 0;

    if (actualDuty12 != duty12 || actualPolarity != polarity || actualEnable != enable) {
        M5IOE1_LOG_E(TAG_PWM, "PWM channel %d verification failed: duty=%d/%d, pol=%d/%d, en=%d/%d", channel, duty12,
                     actualDuty12, polarity, actualPolarity, enable, actualEnable);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 如果启用，将引脚设置为输出模式
    // Step 4: If enabled, set pin to output mode
    if (enable) {
        uint16_t modeReg = 0;
        if (_readReg16(M5IOE1_REG_GPIO_MODE_L, &modeReg)) {
            modeReg |= (1 << pin);
            if (!_writeReg16(M5IOE1_REG_GPIO_MODE_L, modeReg)) {
                M5IOE1_LOG_W(TAG_PWM, "Failed to set pin %d to output mode for PWM", pin);
            }
        }
    }

    // 步骤 5: 验证成功，更新缓存
    // Step 5: Verification passed, update cache
    _pwmStates[channel].duty12   = duty12;
    _pwmStates[channel].polarity = polarity;
    _pwmStates[channel].enabled  = enable;

    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_PWM | M5IOE1_SNAPSHOT_DOMAIN_GPIO);

    M5IOE1_LOG_I(TAG_PWM, "PWM ch%d verified: duty=%d pol=%s en=%s", channel, duty12, polarity ? "Inv" : "Norm",
                 enable ? "On" : "Off");

