prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setPwmConfig(uint8_t channel, bool enable, bool polarity, uint16_t frequency, uint16_t duty12)
{
    if (channel > 3 || duty12 > 0x0FFF) {
        M5IOE1_LOG_E(TAG_PWM, "Invalid PWM config: ch=%d duty12=%d", channel, duty12);
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_PWM, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    static const uint8_t kPwmPinMap[4] = {8, 7, 10, 9};
    uint8_t pin                        = kPwmPinMap[channel];

    m5ioe1_validation_t validation = validateConfig(pin, M5IOE1_CONFIG_PWM, enable);
    if (!validation.valid) {
        M5IOE1_LOG_W(TAG_PWM, "PWM config warning on IO%d: %s", pin + 1, validation.error_msg);
    }

    if (_pinStatesValid && _pinStates[pin].intrEnabled) {
        M5IOE1_LOG_W(TAG_PWM, "PWM pin IO%d has interrupt enabled", pin + 1);
    }

    if (_pwmStatesValid && _pwmFrequency != frequency) {
        for (uint8_t other = 0; other < M5IOE1_MAX_PWM_CHANNELS; other++) {
            if (other == channel) continue;
            if (_pwmStates[other].enabled) {
                M5IOE1_LOG_W(TAG_PWM, "PWM frequency change affects other channels: %d -> %d", _pwmFrequency,
                             frequency);
                break;
            }
        }
    }

    m5ioe1_err_t err = setPwmDuty12bit(channel, duty12, polarity, enable);
    if (err != M5IOE1_OK) return err;
    return setPwmFrequency(frequency);
}

m5ioe1_err_t M5IOE1::getPwmDuty12bit(uint8_t channel, uint16_t* duty12, bool* polarity, bool* enable)
{
    if (channel > 3 || duty12 == nullptr || polarity == nullptr || enable == nullptr) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    uint8_t regL  = M5IOE1_REG_PWM1_DUTY_L + (channel * 2);
    uint16_t data = 0;
    if (!_readReg16(regL, &data)) {
        return M5IOE1_ERR_I2C_COMM;
    }

    *duty12   = data & 0x0FFF;
    *polarity = (data & ((uint16_t)M5IOE1_PWM_POLARITY << 8)) != 0;
    *enable   = (data & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) != 0;

    // 更新缓存
    // Update cache
    _pwmStates[channel].duty12   = *duty12;
    _pwmStates[channel].polarity = *polarity;
    _pwmStates[channel].enabled  = *enable;

    return M5IOE1_OK;
}

// ============================
// Arduino 兼容 analogWrite
// Arduino-compatible analogWrite
// ============================

m5ioe1_err_t M5IOE1::analogWrite(uint8_t channel, uint8_t value)
{
    if (channel > 3) {
        M5IOE1_LOG_E(TAG_PWM, "Invalid channel: ch=%d", channel);
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_PWM, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    // 值为 0 时关闭 PWM 输出
    // Turn off PWM when value is 0
    if (value == 0) {
        return setPwmDuty12bit(channel, 0, false, false);
    }

    // 将 8-bit 值 (0-255) 缩放到 12-bit (0-4095)
    // Scale 8-bit value (0-255) to 12-bit (0-4095)
    // 公式：duty12 = (value * 4095) / 255 = value * 16 + value / 16
    // Formula: duty12 = (value * 4095) / 255 = value * 16 + value / 16
    uint16_t duty12 = (uint16_t)value * 16 + (uint16_t)value / 16;

    // 设置 PWM，默认启用输出，正常极性
    // Set PWM with output enabled, normal polarity
    return setPwmDuty12bit(channel, duty12, false, true);
}

// ============================
// NeoPixel LED 功能
// NeoPixel LED Functions
// ============================

m5ioe1_err_t M5IOE1::setLedCount(uint8_t count)
{
    if (count > M5IOE1_MAX_LED_COUNT) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    uint8_t cfg = count & M5IOE1_LED_NUM_MASK;

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_LED_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to write LED_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_LED_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to read back LED_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    // 只比对 LED 数量位 [5:0]，忽略 REFRESH 位 [6]
    // Only compare LED count bits [5:0], ignore REFRESH bit [6]
    bool countMatch = ((actualCfg & M5IOE1_LED_NUM_MASK) == (cfg & M5IOE1_LED_NUM_MASK));

    if (!countMatch) {
        M5IOE1_LOG_E(TAG_LED, "LED count verification failed: expected=%d, actual=%d", count,
                     actualCfg & M5IOE1_LED_NUM_MASK);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache

    M5IOE1_LOG_I(TAG_LED, "LED count set and verified: %d", count);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setLedColor(uint8_t index, uint8_t r, uint8_t g, uint8_t b)
{
    if (index >= M5IOE1_MAX_LED_COUNT) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    M5IOE1_LOG_D(TAG_LED, "setLedColor: idx=%d RGB(%d,%d,%d)", index, r, g, b);

    // 转换为 RGB565
    // Convert to RGB565
    uint16_t r5     = (r >> 3) & 0x1F;
    uint16_t g6     = (g >> 2) & 0x3F;
    uint16_t b5     = (b >> 3) & 0x1F;
    uint16_t rgb565 = (r5 << 11) | (g6 << 5) | b5;

    uint8_t regAddr = M5IOE1_REG_LED_RAM_START + (index * 2);
    uint8_t data[2] = {(uint8_t)(rgb565 & 0xFF), (uint8_t)((rgb565 >> 8) & 0xFF)};

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeBytes(regAddr, data, 2)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to write LED_RAM register for index %d", index);
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint16_t actualRgb565 = 0;
    uint8_t actualData[2];
    if (!_readBytes(regAddr, actualData, 2)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to read back LED_RAM register for index %d", index);
        return M5IOE1_ERR_I2C_COMM;
    }
    actualRgb565 = ((uint16_t)actualData[1] << 8) | actualData[0];

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    if (actualRgb565 != rgb565) {
        M5IOE1_LOG_E(TAG_LED, "LED color verification failed for index %d: expected=0x%04X, actual=0x%04X", index,
                     rgb565, actualRgb565);
        return M5IOE1_FAIL;
    }

