prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    M5IOE1_LOG_I(TAG_LED, "LED color set and verified for index %d: RGB(%d,%d,%d)", index, r, g, b);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setLedColor(uint8_t index, m5ioe1_rgb_t color)
{
    return setLedColor(index, color.r, color.g, color.b);
}

m5ioe1_err_t M5IOE1::refreshLeds()
{
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_LED, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_LED_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to read LED_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    cfg |= M5IOE1_LED_REFRESH;
    if (!_writeReg(M5IOE1_REG_LED_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to write LED_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::disableLeds()
{
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_LED_CFG, 0)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to write LED_CFG register for disable");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_LED_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to read back LED_CFG register for disable");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    // LED 数量为 0 且 REFRESH 位为 0
    // LED count is 0 and REFRESH bit is 0
    if (actualCfg != 0) {
        M5IOE1_LOG_E(TAG_LED, "LED disable verification failed: expected=0, actual=0x%02X", actualCfg);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache

    M5IOE1_LOG_I(TAG_LED, "LEDs disabled and verified");
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::clearLedRam()
{
    M5IOE1_LOG_D(TAG_LED, "clearLedRam");
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_LED, "Device not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    // 清除所有 LED RAM (0x30 - 0x6F, 共 64 字节，支持 32 个 LED)
    // Clear all LED RAM (0x30 - 0x6F, 64 bytes total, supports 32 LEDs)
    uint8_t zeroData[64] = {0};

    M5IOE1_LOG_I(TAG_LED, "Clearing LED RAM...");

    // 分块写入，每次写入 8 字节，避免 I2C 缓冲区溢出
    // Write in chunks of 8 bytes to avoid I2C buffer overflow
    for (uint8_t offset = 0; offset < 64; offset += 8) {
        uint8_t regAddr = M5IOE1_REG_LED_RAM_START + offset;
        if (!_writeBytes(regAddr, zeroData, 8)) {
            M5IOE1_LOG_E(TAG_LED, "Failed to clear LED RAM at offset %d", offset);
            return M5IOE1_ERR_I2C_COMM;
        }
        // 每次写入后增加延迟，确保设备有时间处理
        // Add delay after each write to ensure device has time to process
        M5IOE1_DELAY_MS(2);
    }

    M5IOE1_LOG_I(TAG_LED, "LED RAM cleared successfully");
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setLeds(const m5ioe1_rgb_t* colors, uint8_t count, uint8_t arraySize, bool autoRefresh)
{
    // 步骤 1: 参数验证
    // Step 1: Parameter validation
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_LED, "Device not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    if (colors == nullptr) {
        M5IOE1_LOG_E(TAG_LED, "Colors array is null");
        return M5IOE1_ERR_INVALID_ARG;
    }

    if (count == 0) {
        M5IOE1_LOG_E(TAG_LED, "LED count cannot be 0");
        return M5IOE1_ERR_INVALID_ARG;
    }

    if (count > M5IOE1_MAX_LED_COUNT) {
        M5IOE1_LOG_E(TAG_LED, "LED count %d exceeds maximum %d", count, M5IOE1_MAX_LED_COUNT);
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 边界检查：确保不会越界访问数组
    // Bounds check: ensure no out-of-bounds array access
    if (count > arraySize) {
        M5IOE1_LOG_E(TAG_LED, "LED count %d exceeds array size %d (would cause out-of-bounds access)", count,
                     arraySize);
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 步骤 2: 设置 LED 数量
    // Step 2: Set LED count
    uint8_t cfg = count & M5IOE1_LED_NUM_MASK;
    if (!_writeReg(M5IOE1_REG_LED_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to write LED_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 验证 LED 数量设置
    // Verify LED count setting
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_LED_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_LED, "Failed to read back LED_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    if ((actualCfg & M5IOE1_LED_NUM_MASK) != cfg) {
        M5IOE1_LOG_E(TAG_LED, "LED count verification failed: expected=%d, actual=%d", cfg,
                     actualCfg & M5IOE1_LED_NUM_MASK);
        return M5IOE1_FAIL;
    }

    // 步骤 3: 写入所有 LED 颜色数据并回读验证
    // Step 3: Write all LED color data and read-back verification
    for (uint8_t i = 0; i < count; i++) {
        // 转换为 RGB565
        // Convert to RGB565
        uint16_t r5     = (colors[i].r >> 3) & 0x1F;
        uint16_t g6     = (colors[i].g >> 2) & 0x3F;
        uint16_t b5     = (colors[i].b >> 3) & 0x1F;
        uint16_t rgb565 = (r5 << 11) | (g6 << 5) | b5;

        uint8_t regAddr = M5IOE1_REG_LED_RAM_START + (i * 2);
        uint8_t data[2] = {(uint8_t)(rgb565 & 0xFF), (uint8_t)((rgb565 >> 8) & 0xFF)};

        if (!_writeBytes(regAddr, data, 2)) {
            M5IOE1_LOG_E(TAG_LED, "Failed to write LED_RAM for index %d", i);
            return M5IOE1_ERR_I2C_COMM;
        }

        // 回读验证颜色数据
        // Read-back verification for color data
        uint8_t actualData[2];
        if (!_readBytes(regAddr, actualData, 2)) {
            M5IOE1_LOG_E(TAG_LED, "Failed to read back LED_RAM for index %d", i);
            return M5IOE1_ERR_I2C_COMM;
        }
        uint16_t actualRgb565 = ((uint16_t)actualData[1] << 8) | actualData[0];
        if (actualRgb565 != rgb565) {
            M5IOE1_LOG_E(TAG_LED, "LED color verification failed for index %d: expected=0x%04X, actual=0x%04X", i,
                         rgb565, actualRgb565);
            return M5IOE1_FAIL;
        }
    }

    // 步骤 4: 更新缓存
    // Step 4: Update cache

    // 步骤 5: 可选刷新
    // Step 5: Optional refresh
    if (autoRefresh) {
        if (!_readReg(M5IOE1_REG_LED_CFG, &actualCfg)) {
            M5IOE1_LOG_E(TAG_LED, "Failed to read LED_CFG for refresh");
            return M5IOE1_ERR_I2C_COMM;
        }
        actualCfg |= M5IOE1_LED_REFRESH;
        if (!_writeReg(M5IOE1_REG_LED_CFG, actualCfg)) {
            M5IOE1_LOG_E(TAG_LED, "Failed to trigger LED refresh");
            return M5IOE1_ERR_I2C_COMM;
        }
    }

    M5IOE1_LOG_I(TAG_LED, "Set %d LEDs successfully%s", count, autoRefresh ? " (refreshed)" : "");
    return M5IOE1_OK;
}

// ============================
// AW8737A 脉冲功能
// AW8737A Pulse Functions
// ============================

m5ioe1_err_t M5IOE1::setAw8737aPulse(uint8_t pin, m5ioe1_aw8737a_pulse_t pulseNum, m5ioe1_aw8737a_refresh_t refresh)
{
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_AMP, "Device not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    // 验证引脚范围 (0-13)
    // Validate pin range (0-13)
    if (pin >= M5IOE1_MAX_GPIO_PINS) {
        M5IOE1_LOG_E(TAG_AMP, "Invalid pin number: %d (valid range: 0-%d)", pin, M5IOE1_MAX_GPIO_PINS - 1);
        return M5IOE1_ERR_INVALID_ARG;
    }

