prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    // 验证脉冲编号 (0-3)
    // Validate pulse number (0-3)
    if (pulseNum > M5IOE1_AW8737A_PULSE_3) {
        M5IOE1_LOG_E(TAG_AMP, "Invalid pulse number: %d (valid range: 0-3)", pulseNum);
        return M5IOE1_ERR_INVALID_ARG;
    }

    // 检查引脚是否为输出模式，如果不是则自动配置为推挽输出
    // Check if pin is output mode, if not auto-configure as push-pull output
    if (!_pinStates[pin].isOutput) {
        M5IOE1_LOG_I(TAG_AMP, "AW8737A: Pin %d not output mode, auto-configuring as push-pull output", pin);
        pinMode(pin, OUTPUT);
    }

    // 保存配置到成员变量
    // Save configuration to member variables
    _aw8737aConfigured = true;
    _aw8737aPin        = pin;
    _aw8737aPulseNum   = pulseNum;

    // 构建寄存器值（不含 REFRESH 位）
    // Build register value (without REFRESH bit)
    // [7] REFRESH | [6:5] NUM[1:0] | [4:0] GPIO[4:0]
    uint8_t regValue = 0;
    regValue |= (pin & M5IOE1_AW8737A_GPIO_MASK);                                    // 位[4:0]: GPIO 选择
                                                                                     // Bits[4:0]: GPIO selection
    regValue |= ((pulseNum & M5IOE1_AW8737A_NUM_MASK) << M5IOE1_AW8737A_NUM_SHIFT);  // 位[6:5]: 脉冲编号
                                                                                     // Bits[6:5]: Pulse number

    // 写入寄存器（不含 REFRESH 位）
    // Write register (without REFRESH bit)
    if (!_writeReg(M5IOE1_REG_AW8737A_PULSE, regValue)) {
        M5IOE1_LOG_E(TAG_AMP, "Failed to set AW8737A pulse config");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 更新缓存
    // Update cache
    _aw8737aRegValue   = regValue;
    _aw8737aStateValid = true;

    // 回读验证
    // Read-back verification
    uint8_t actualReg = 0;
    if (!_readReg(M5IOE1_REG_AW8737A_PULSE, &actualReg)) {
        M5IOE1_LOG_E(TAG_AMP, "Failed to read back AW8737A pulse register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 验证关键位是否匹配
    // Verify critical bits match
    uint8_t actualValue = actualReg & 0x7F;
    if (actualValue != regValue) {
        M5IOE1_LOG_E(TAG_AMP, "AW8737A pulse verification failed: expected=0x%02X, actual=0x%02X", regValue,
                     actualValue);
        return M5IOE1_FAIL;
    }

    M5IOE1_LOG_I(TAG_AMP, "AW8737A pulse configured: pin=%d, num=%d (reg=0x%02X)", pin, pulseNum, regValue);

    // 如果需要立即刷新，调用 refreshAw8737aPulse
    // If immediate refresh needed, call refreshAw8737aPulse
    if (refresh == M5IOE1_AW8737A_REFRESH_NOW) {
        return refreshAw8737aPulse();
    }

    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_AW8737A);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::refreshAw8737aPulse()
{
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_AMP, "Device not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    // 检查是否已配置
    // Check if configured
    if (!_aw8737aConfigured) {
        M5IOE1_LOG_W(TAG_AMP, "AW8737A pulse not configured, executing anyway");
    }

    // 检查引脚是否为输出模式，如果不是则自动配置为推挽输出
    // Check if pin is output mode, if not auto-configure as push-pull output
    if (!_pinStates[_aw8737aPin].isOutput) {
        M5IOE1_LOG_I(TAG_AMP, "AW8737A: Pin %d not output mode, auto-configuring as push-pull output", _aw8737aPin);
        pinMode(_aw8737aPin, OUTPUT);
    }

    // 读取当前寄存器值
    // Read current register value
    uint8_t regValue = 0;
    if (!_readReg(M5IOE1_REG_AW8737A_PULSE, &regValue)) {
        M5IOE1_LOG_E(TAG_AMP, "Failed to read AW8737A pulse register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 设置 REFRESH 位
    // Set REFRESH bit
    regValue |= M5IOE1_AW8737A_REFRESH;

    if (!_writeReg(M5IOE1_REG_AW8737A_PULSE, regValue)) {
        M5IOE1_LOG_E(TAG_AMP, "Failed to refresh AW8737A pulse");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 输出详细日志
    // Output detailed log
    const char* driveStr = (_pinStates[_aw8737aPin].drive == M5IOE1_DRIVE_PUSHPULL) ? "PUSH-PULL" : "OPEN-DRAIN";
    M5IOE1_LOG_I(TAG_AMP, "AW8737A pulse refresh: pin=%d, pulseNum=%d, mode=OUTPUT, drive=%s", _aw8737aPin,
                 _aw8737aPulseNum, driveStr);

    // 写入位 7 后等待 20ms，因为它会影响 I2C 通信
    // Wait 20ms after writing bit 7, as it affects I2C communication
    M5IOE1_DELAY_MS(20);

    _autoSnapshotUpdate(M5IOE1_SNAPSHOT_DOMAIN_AW8737A);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setAw8737aMode(uint8_t pin, m5ioe1_aw8737a_mode_t mode, m5ioe1_aw8737a_refresh_t refresh)
{
    // Mode 直接映射到 Pulse (MODE_1=0pulse, MODE_2=1pulse, MODE_3=2pulses, MODE_4=3pulses)
    // Mode directly maps to Pulse
    if (mode > M5IOE1_AW8737A_MODE_4) {
        M5IOE1_LOG_E(TAG_AMP, "Invalid AW8737A mode: %d (valid range: 0-3)", mode);
        return M5IOE1_ERR_INVALID_ARG;
    }

    return setAw8737aPulse(pin, (m5ioe1_aw8737a_pulse_t)mode, refresh);
}

m5ioe1_err_t M5IOE1::refreshAw8737aMode()
{
    return refreshAw8737aPulse();
}

// ============================
// RTC RAM 功能
// RTC RAM Functions
// ============================

m5ioe1_err_t M5IOE1::writeRtcRAM(uint8_t offset, const uint8_t* data, uint8_t length)
{
    if (data == nullptr || offset >= M5IOE1_RTC_RAM_SIZE || length == 0 || (offset + length) > M5IOE1_RTC_RAM_SIZE) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t regAddr = M5IOE1_REG_RTC_RAM_START + offset;

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeBytes(regAddr, data, length)) {
        M5IOE1_LOG_E(TAG_SYS, "Failed to write RTC_RAM register at offset %d", offset);
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualData[M5IOE1_RTC_RAM_SIZE];
    if (!_readBytes(regAddr, actualData, length)) {
        M5IOE1_LOG_E(TAG_SYS, "Failed to read back RTC_RAM register at offset %d", offset);
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    // 逐字节比较写入的数据
    // Compare written data byte by byte
    bool allMatch = true;
    for (uint8_t i = 0; i < length; i++) {
        if (actualData[i] != data[i]) {
            allMatch = false;
            M5IOE1_LOG_E(TAG_SYS, "RTC_RAM verification failed at offset %d: expected=0x%02X, actual=0x%02X",
                         offset + i, data[i], actualData[i]);
            break;
        }
    }

    if (!allMatch) {
        return M5IOE1_FAIL;
    }

    M5IOE1_LOG_I(TAG_SYS, "RTC_RAM write and verified: offset=%d, length=%d", offset, length);
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::readRtcRAM(uint8_t offset, uint8_t* data, uint8_t length)
{
    if (data == nullptr || offset >= M5IOE1_RTC_RAM_SIZE || length == 0 || (offset + length) > M5IOE1_RTC_RAM_SIZE) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        return M5IOE1_ERR_NOT_INIT;
    }

