prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    uint8_t regAddr = M5IOE1_REG_RTC_RAM_START + offset;
    return _readBytes(regAddr, data, length) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

// ============================
// 系统配置
// System Configuration
// ============================

m5ioe1_err_t M5IOE1::setI2cConfig(uint8_t sleepTime, m5ioe1_i2c_speed_t speed, m5ioe1_wake_edge_t wakeEdge,
                                  m5ioe1_pull_config_t pullConfig)
{
    if (sleepTime > 15) {
        M5IOE1_LOG_E(TAG_I2C, "Invalid I2C sleep time: %d", sleepTime);
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint32_t targetFreq = (speed == M5IOE1_I2C_SPEED_400K) ? M5IOE1_I2C_FREQ_400K : M5IOE1_I2C_FREQ_100K;
    bool speedChanged   = (targetFreq != _requestedSpeed);

    uint8_t cfg = (sleepTime & M5IOE1_I2C_SLEEP_MASK);
    if (speed == M5IOE1_I2C_SPEED_400K) cfg |= M5IOE1_I2C_SPEED_400K_BIT;
    if (wakeEdge == M5IOE1_WAKE_EDGE_RISING) cfg |= M5IOE1_I2C_WAKE_RISING;
    if (pullConfig == M5IOE1_PULL_DISABLED) cfg |= M5IOE1_I2C_PULL_OFF;

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_I2C_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to write I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read back I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证关键位是否匹配
    // Step 3: Verify critical bits match
    uint8_t expectedSleep = sleepTime & M5IOE1_I2C_SLEEP_MASK;
    uint8_t actualSleep   = actualCfg & M5IOE1_I2C_SLEEP_MASK;
    bool actualSpeed400k  = (actualCfg & M5IOE1_I2C_SPEED_400K_BIT) != 0;
    bool actualWakeRising = (actualCfg & M5IOE1_I2C_WAKE_RISING) != 0;
    bool actualPullOff    = (actualCfg & M5IOE1_I2C_PULL_OFF) != 0;

    if (actualSleep != expectedSleep || actualSpeed400k != (speed == M5IOE1_I2C_SPEED_400K) ||
        actualWakeRising != (wakeEdge == M5IOE1_WAKE_EDGE_RISING) ||
        actualPullOff != (pullConfig == M5IOE1_PULL_DISABLED)) {
        M5IOE1_LOG_E(TAG_I2C, "I2C_CFG verification failed: expected=0x%02X, actual=0x%02X", cfg, actualCfg);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 如果速度改变，切换主机 I2C 总线
    // Step 4: If speed changed, switch host I2C bus
    if (speedChanged) {
        M5IOE1_LOG_D(TAG_I2C, "Switching host I2C bus from %" PRIu32 " Hz to %" PRIu32 " Hz", _requestedSpeed,
                     targetFreq);

#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            _commFreq = targetFreq;
            M5IOE1_LOG_D(TAG_I2C, "M5Unified I2C frequency updated to %" PRIu32 " Hz", targetFreq);
        } else
#endif
            if (_wire != nullptr) {
            _wire->end();
            M5IOE1_DELAY_MS(10);
            if (!_wire->begin(_sda, _scl, targetFreq)) {
                M5IOE1_LOG_E(TAG_I2C, "Failed to reinitialize I2C bus at %" PRIu32 " Hz", targetFreq);
                // 回滚设备配置
                // Rollback device config
                uint8_t rollbackCfg = actualCfg;
                if (speed == M5IOE1_I2C_SPEED_400K) {
                    rollbackCfg &= ~M5IOE1_I2C_SPEED_400K_BIT;
                } else {
                    rollbackCfg |= M5IOE1_I2C_SPEED_400K_BIT;
                }
                _writeReg(M5IOE1_REG_I2C_CFG, rollbackCfg);
                return M5IOE1_ERR_I2C_CONFIG;
            }
            M5IOE1_DELAY_MS(10);
        }
#else
        esp_err_t ret;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                if (_i2c_master_dev != nullptr) {
                    ret = i2c_master_bus_rm_device(_i2c_master_dev);
                    if (ret != ESP_OK) {
                        M5IOE1_LOG_E(TAG_I2C, "Failed to remove I2C device: %s", esp_err_to_name(ret));
                        return M5IOE1_ERR_I2C_CONFIG;
                    }
                    _i2c_master_dev = nullptr;

                    i2c_device_config_t dev_config = {
                        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
                        .device_address  = _addr,
                        .scl_speed_hz    = targetFreq,
                        .scl_wait_us     = 0,
                        .flags           = {.disable_ack_check = false},
                    };

                    ret = i2c_master_bus_add_device(_i2c_master_bus, &dev_config, &_i2c_master_dev);
                    if (ret != ESP_OK) {
                        M5IOE1_LOG_E(TAG_I2C, "Failed to add I2C device at %" PRIu32 " Hz: %s", targetFreq,
                                     esp_err_to_name(ret));
                        return M5IOE1_ERR_I2C_CONFIG;
                    }
                }
                break;
#endif  // M5IOE1_HAS_I2C_MASTER

#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                if (_i2c_device != nullptr) {
                    ret = i2c_bus_device_delete(&_i2c_device);
                    if (ret != ESP_OK) {
                        M5IOE1_LOG_E(TAG_I2C, "Failed to delete I2C device: %s", esp_err_to_name(ret));
                        return M5IOE1_ERR_I2C_CONFIG;
                    }

                    _i2c_device = i2c_bus_device_create(_i2c_bus, _addr, targetFreq);
                    if (_i2c_device == nullptr) {
                        M5IOE1_LOG_E(TAG_I2C, "Failed to create I2C device at %" PRIu32 " Hz", targetFreq);
                        return M5IOE1_ERR_I2C_CONFIG;
                    }
                }
                break;
#endif  // M5IOE1_HAS_I2C_BUS

#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY: {
                i2c_config_t i2c_conf     = {};
                i2c_conf.mode             = I2C_MODE_MASTER;
                i2c_conf.sda_io_num       = _sda;
                i2c_conf.scl_io_num       = _scl;
                i2c_conf.sda_pullup_en    = GPIO_PULLUP_ENABLE;
                i2c_conf.scl_pullup_en    = GPIO_PULLUP_ENABLE;
                i2c_conf.master.clk_speed = targetFreq;
                ret                       = i2c_param_config(_port, &i2c_conf);
                if (ret != ESP_OK) {
                    M5IOE1_LOG_E(TAG_I2C, "i2c_param_config failed: %s", esp_err_to_name(ret));
                    return M5IOE1_ERR_I2C_CONFIG;
                }
                break;
            }
#endif  // !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS

#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                _commFreq = targetFreq;
                M5IOE1_LOG_D(TAG_I2C, "M5Unified I2C frequency updated to %" PRIu32 " Hz", targetFreq);
                break;
#endif
            default:
                break;
        }
#endif

        // 步骤 5: 验证通信仍然有效
        // Step 5: Verify communication still works
        uint16_t uid = 0;
        if (!_readReg16(M5IOE1_REG_UID_L, &uid)) {
            M5IOE1_LOG_E(TAG_I2C, "Communication failed after switching to %" PRIu32 " Hz", targetFreq);
            // 回滚
            // Rollback
            uint32_t originalFreq = _requestedSpeed;
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
            if (_m5_i2c) {
                _commFreq = originalFreq;
            } else
#endif
                if (_wire != nullptr) {
                _wire->end();
                M5IOE1_DELAY_MS(10);
                _wire->begin(_sda, _scl, originalFreq);
                M5IOE1_DELAY_MS(10);
            }
#else
            switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
                case M5IOE1_I2C_DRIVER_SELF_CREATED:
                case M5IOE1_I2C_DRIVER_MASTER:
                    if (_i2c_master_dev != nullptr) {
                        i2c_master_bus_rm_device(_i2c_master_dev);
                        i2c_device_config_t dev_config = {
                            .dev_addr_length = I2C_ADDR_BIT_LEN_7,
                            .device_address  = _addr,
                            .scl_speed_hz    = originalFreq,
                            .scl_wait_us     = 0,
                            .flags           = {.disable_ack_check = false},
                        };
                        i2c_master_bus_add_device(_i2c_master_bus, &dev_config, &_i2c_master_dev);
                    }
                    break;
#endif  // M5IOE1_HAS_I2C_MASTER
#if M5IOE1_HAS_I2C_BUS
                case M5IOE1_I2C_DRIVER_BUS:
                    if (_i2c_device != nullptr) {
                        i2c_bus_device_delete(&_i2c_device);
                        _i2c_device = i2c_bus_device_create(_i2c_bus, _addr, originalFreq);
                    }
                    break;
#endif  // M5IOE1_HAS_I2C_BUS
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
                case M5IOE1_I2C_DRIVER_LEGACY: {
                    i2c_config_t i2c_conf     = {};
                    i2c_conf.mode             = I2C_MODE_MASTER;
                    i2c_conf.sda_io_num       = _sda;
                    i2c_conf.scl_io_num       = _scl;
                    i2c_conf.sda_pullup_en    = GPIO_PULLUP_ENABLE;
                    i2c_conf.scl_pullup_en    = GPIO_PULLUP_ENABLE;
                    i2c_conf.master.clk_speed = originalFreq;
                    i2c_param_config(_port, &i2c_conf);  // best effort rollback
                    break;
                }
#endif  // !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
#if M5IOE1_HAS_M5UNIFIED_I2C
                case M5IOE1_I2C_DRIVER_M5UNIFIED:
                    _commFreq = originalFreq;
                    break;
#endif
                default:
                    break;
            }
#endif
            // 回滚设备配置
            // Rollback device config
            uint8_t rollbackCfg = actualCfg;
            if (speed == M5IOE1_I2C_SPEED_400K) {
                rollbackCfg &= ~M5IOE1_I2C_SPEED_400K_BIT;
            } else {
                rollbackCfg |= M5IOE1_I2C_SPEED_400K_BIT;
            }
            _writeReg(M5IOE1_REG_I2C_CFG, rollbackCfg);
            return M5IOE1_ERR_I2C_COMM;
        }

        // 更新请求的速度
        // Update requested speed
        _requestedSpeed = targetFreq;
        M5IOE1_LOG_D(TAG_I2C, "Host I2C bus switched to %" PRIu32 " Hz", targetFreq);
    }

    // 步骤 6: 验证成功，更新缓存
    // Step 6: Verification passed, update cache
    _i2cConfig.sleepTime  = sleepTime;
    _i2cConfig.speed400k  = (speed == M5IOE1_I2C_SPEED_400K);
    _i2cConfig.wakeRising = (wakeEdge == M5IOE1_WAKE_EDGE_RISING);
    _i2cConfig.pullOff    = (pullConfig == M5IOE1_PULL_DISABLED);
    _i2cConfigValid       = true;

    // 若配置了休眠时间，自动启用 autoWake 防止数据丢失
    // If sleep time is configured, auto-enable autoWake to prevent data loss
    if (sleepTime > 0 && !_autoWakeEnabled) {
        setAutoWakeEnable(true);
        M5IOE1_LOG_W(TAG_I2C, "I2C sleep enabled (sleepTime=%d), auto-wake automatically enabled", sleepTime);
    }

    _updatePollingForI2cSleep(sleepTime);

    M5IOE1_LOG_I(TAG_I2C, "I2C config set and verified: sleep=%d, speed=%s, wake=%s, pull=%s", sleepTime,
                 speed == M5IOE1_I2C_SPEED_400K ? "400K" : "100K",
                 wakeEdge == M5IOE1_WAKE_EDGE_RISING ? "rising" : "falling",
                 pullConfig == M5IOE1_PULL_DISABLED ? "off" : "on");

