prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setI2cSleepTime(uint8_t sleepTime)
{
    if (sleepTime > 15) {
        M5IOE1_LOG_E(TAG_I2C, "Invalid I2C sleep time: %d", sleepTime);
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 清除 SLEEP 位 [3:0]，设置新值
    // Clear SLEEP bits [3:0], set new value
    cfg = (cfg & ~M5IOE1_I2C_SLEEP_MASK) | (sleepTime & M5IOE1_I2C_SLEEP_MASK);

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_I2C_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to write I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read back I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证 SLEEP 位是否匹配
    // Step 3: Verify SLEEP bits match
    uint8_t actualSleep = actualCfg & M5IOE1_I2C_SLEEP_MASK;
    if (actualSleep != sleepTime) {
        M5IOE1_LOG_E(TAG_I2C, "I2C_CFG sleep time verification failed: expected=%d, actual=%d", sleepTime, actualSleep);
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _i2cConfig.sleepTime = sleepTime;
    _i2cConfigValid      = true;

    M5IOE1_LOG_I(TAG_I2C, "I2C sleep time set and verified to %d", sleepTime);

    // 若配置了休眠时间，自动启用 autoWake 防止数据丢失
    // If sleep time is configured, auto-enable autoWake to prevent data loss
    if (sleepTime > 0 && !_autoWakeEnabled) {
        setAutoWakeEnable(true);
        M5IOE1_LOG_W(TAG_I2C, "I2C sleep enabled, auto-wake automatically enabled");
    }

    _updatePollingForI2cSleep(sleepTime);

    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getI2cSleepTime(uint8_t* sleepTime)
{
    if (sleepTime == nullptr) {
        M5IOE1_LOG_E(TAG_I2C, "getI2cSleepTime sleepTime is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 更新缓存
    // Update cache
    _i2cConfig.sleepTime = cfg & M5IOE1_I2C_SLEEP_MASK;
    _i2cConfigValid      = true;

    *sleepTime = _i2cConfig.sleepTime;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setI2cWakeEdge(m5ioe1_wake_edge_t edge)
{
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 设置或清除 WAKE 位 [5]
    // Set or clear WAKE bit [5]
    if (edge == M5IOE1_WAKE_EDGE_RISING) {
        cfg |= M5IOE1_I2C_WAKE_RISING;
    } else {
        cfg &= ~M5IOE1_I2C_WAKE_RISING;
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_I2C_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to write I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read back I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证 WAKE 位是否匹配
    // Step 3: Verify WAKE bit matches
    bool actualWakeRising   = (actualCfg & M5IOE1_I2C_WAKE_RISING) != 0;
    bool expectedWakeRising = (edge == M5IOE1_WAKE_EDGE_RISING);
    if (actualWakeRising != expectedWakeRising) {
        M5IOE1_LOG_E(TAG_I2C, "I2C_CFG wake edge verification failed: expected=%s, actual=%s",
                     expectedWakeRising ? "rising" : "falling", actualWakeRising ? "rising" : "falling");
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _i2cConfig.wakeRising = expectedWakeRising;
    _i2cConfigValid       = true;

    M5IOE1_LOG_I(TAG_I2C, "I2C wake edge set and verified to %s", expectedWakeRising ? "rising" : "falling");

    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getI2cWakeEdge(m5ioe1_wake_edge_t* edge)
{
    if (edge == nullptr) {
        M5IOE1_LOG_E(TAG_I2C, "getI2cWakeEdge edge is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 更新缓存
    // Update cache
    _i2cConfig.wakeRising = (cfg & M5IOE1_I2C_WAKE_RISING) != 0;
    _i2cConfigValid       = true;

    *edge = _i2cConfig.wakeRising ? M5IOE1_WAKE_EDGE_RISING : M5IOE1_WAKE_EDGE_FALLING;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::setI2cPullConfig(m5ioe1_pull_config_t config)
{
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 设置或清除 INT_PU/PD 位 [6]
    // Set or clear INT_PU/PD bit [6]
    if (config == M5IOE1_PULL_DISABLED) {
        cfg |= M5IOE1_I2C_PULL_OFF;
    } else {
        cfg &= ~M5IOE1_I2C_PULL_OFF;
    }

    // 步骤 1: 写入寄存器
    // Step 1: Write register
    if (!_writeReg(M5IOE1_REG_I2C_CFG, cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to write I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

