prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    // 步骤 2: 回读验证
    // Step 2: Read-back verification
    uint8_t actualCfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &actualCfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read back I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 3: 验证 INT_PU/PD 位是否匹配
    // Step 3: Verify INT_PU/PD bit matches
    bool actualPullOff   = (actualCfg & M5IOE1_I2C_PULL_OFF) != 0;
    bool expectedPullOff = (config == M5IOE1_PULL_DISABLED);
    if (actualPullOff != expectedPullOff) {
        M5IOE1_LOG_E(TAG_I2C, "I2C_CFG pull config verification failed: expected=%s, actual=%s",
                     expectedPullOff ? "disabled" : "enabled", actualPullOff ? "disabled" : "enabled");
        return M5IOE1_FAIL;
    }

    // 步骤 4: 验证成功，更新缓存
    // Step 4: Verification passed, update cache
    _i2cConfig.pullOff = expectedPullOff;
    _i2cConfigValid    = true;

    M5IOE1_LOG_I(TAG_I2C, "I2C internal pull-up set and verified to %s", expectedPullOff ? "disabled" : "enabled");

    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getI2cPullConfig(m5ioe1_pull_config_t* config)
{
    if (config == nullptr) {
        M5IOE1_LOG_E(TAG_I2C, "getI2cPullConfig config is null");
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C_CFG register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 更新缓存
    // Update cache
    _i2cConfig.pullOff = (cfg & M5IOE1_I2C_PULL_OFF) != 0;
    _i2cConfigValid    = true;

    *config = _i2cConfig.pullOff ? M5IOE1_PULL_DISABLED : M5IOE1_PULL_ENABLED;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::factoryReset()
{
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    if (!_writeReg(M5IOE1_REG_FACTORY_RESET, M5IOE1_FACTORY_RESET_KEY)) {
        return M5IOE1_ERR_I2C_COMM;
    }

    M5IOE1_DELAY_MS(100);
    _initialized    = false;
    _pinStatesValid = false;
    _pwmStatesValid = false;
    _adcStateValid  = false;
    _clearPinStates();
    _clearPwmStates();
    _clearAdcState();
    M5IOE1_LOG_W(TAG_SYS, "Factory reset complete. Call begin() to reinitialize.");

    return M5IOE1_OK;
}

// ============================
// 自动唤醒功能
// Auto Wake Feature
// ============================

void M5IOE1::setAutoWakeEnable(bool enable)
{
    _autoWakeEnabled = enable;
    if (enable) {
        _lastCommTime = M5IOE1_GET_TIME_MS();
    }
    M5IOE1_LOG_I(TAG_I2C, "Auto wake %s", enable ? "enabled" : "disabled");
}

bool M5IOE1::isAutoWakeEnabled() const
{
    return _autoWakeEnabled;
}

m5ioe1_err_t M5IOE1::sendWakeSignal()
{
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
    if (_m5_i2c) {
        M5IOE1_M5UNIFIED_SEND_WAKE(_m5_i2c, _addr, _commFreq);
        return M5IOE1_OK;
    }
#endif
    M5IOE1_I2C_ARDUINO_SEND_WAKE(_wire, _addr);
    return M5IOE1_OK;
#else
    switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
        case M5IOE1_I2C_DRIVER_SELF_CREATED:
        case M5IOE1_I2C_DRIVER_MASTER:
            return M5IOE1_I2C_MASTER_SEND_WAKE(_i2c_master_bus, _addr) == ESP_OK ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
#endif
#if M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_BUS:
            return M5IOE1_I2C_BUS_SEND_WAKE(_i2c_device, M5IOE1_REG_REV) == ESP_OK ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_LEGACY:
            return M5IOE1_I2C_LEGACY_SEND_WAKE(_port, _addr) == ESP_OK ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
        case M5IOE1_I2C_DRIVER_M5UNIFIED:
            return M5IOE1_M5UNIFIED_SEND_WAKE(_m5_i2c, _addr, _commFreq) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
#endif
        default:
            return M5IOE1_ERR_INTERNAL;
    }
#endif
}

void M5IOE1::_checkAutoWake()
{
    if (!_autoWakeEnabled || !_i2cConfigValid || _i2cConfig.sleepTime == 0) return;

    uint32_t now     = M5IOE1_GET_TIME_MS();
    uint32_t elapsed = now - _lastCommTime;

    // 如果距离上次通信超过1秒，发送唤醒信号
    // If more than 1 second since last communication, send wake signal
    if (elapsed >= 1000) {
        sendWakeSignal();
        M5IOE1_DELAY_MS(10);
    }
    _lastCommTime = now;
}

void M5IOE1::_updatePollingForI2cSleep(uint8_t sleepTime)
{
    if (_intMode != M5IOE1_INT_MODE_POLLING) return;

#ifdef ARDUINO
    if (sleepTime > 0) {
        if (_pollTask != nullptr) {
            _cleanupPollingArduino();
        }
    } else {
        if (_pollTask == nullptr) {
            _setupPollingArduino();
        }
    }
#else
    if (sleepTime > 0) {
        if (_pollTask != nullptr) {
            _cleanupPolling();
        }
    } else {
        if (_pollTask == nullptr) {
            _setupPolling();
        }
    }
#endif
}

// ============================
// 状态快照功能
// State Snapshot Functions
// ============================

void M5IOE1::setAutoSnapshot(bool enable)
{
    _autoSnapshot = enable;
}

bool M5IOE1::isAutoSnapshotEnabled() const
{
    return _autoSnapshot;
}

m5ioe1_err_t M5IOE1::updateSnapshot()
{
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    bool gpio    = _snapshotPinStates();
    bool pwm     = _snapshotPwmStates();
    bool adc     = _snapshotAdcState();
    bool aw8737a = _snapshotAw8737a();

    return (gpio && pwm && adc && aw8737a) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

// ============================
// 调试功能
// Debug Functions
// ============================

m5ioe1_err_t M5IOE1::getModeReg(uint16_t* reg)
{
    if (reg == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_GPIO_MODE_L, reg) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getOutputReg(uint16_t* reg)
{
    if (reg == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_GPIO_OUT_L, reg) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getInputReg(uint16_t* reg)
{
    if (reg == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_GPIO_IN_L, reg) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getPullUpReg(uint16_t* reg)
{
    if (reg == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_GPIO_PU_L, reg) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getPullDownReg(uint16_t* reg)
{
    if (reg == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_GPIO_PD_L, reg) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

m5ioe1_err_t M5IOE1::getDriveReg(uint16_t* reg)
{
    if (reg == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;
    return _readReg16(M5IOE1_REG_GPIO_DRV_L, reg) ? M5IOE1_OK : M5IOE1_ERR_I2C_COMM;
}

// ============================
// 配置验证
// Configuration Validation
// ============================

m5ioe1_validation_t M5IOE1::validateConfig(uint8_t pin, m5ioe1_config_type_t configType, bool enable)
{
    m5ioe1_validation_t result = {false, {0}, 0xFF};

    // 基本验证
    // Basic validation
    if (!_isValidPin(pin)) {
        snprintf(result.error_msg, sizeof(result.error_msg), "Invalid pin %d", pin);
        return result;
    }

    if (!_initialized) {
        snprintf(result.error_msg, sizeof(result.error_msg), "Not initialized");
        return result;
    }

    // 如果禁用，无需冲突检查
    // If disabling, no conflict check needed
    if (!enable) {
        result.valid = true;
        return result;
    }

