prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    uint8_t mutexPin = 0xFF;

    switch (configType) {
        case M5IOE1_CONFIG_GPIO_INPUT:
        case M5IOE1_CONFIG_GPIO_OUTPUT:
            // 检查引脚是否用于特殊功能
            // Check if pin is being used for special functions
            if (_hasActivePwm(pin)) {
                snprintf(result.error_msg, sizeof(result.error_msg),
                         "Pin %d is used for PWM. Disable first (e.g. setPwmDuty)", pin);
                return result;
            }
            if (_hasActiveAdc(pin)) {
                snprintf(result.error_msg, sizeof(result.error_msg),
                         "Pin %d is used for ADC. Disable first (disableAdc())", pin);
                return result;
            }
            if (_isNeopixelPin(pin) && _isLedEnabled()) {
                snprintf(result.error_msg, sizeof(result.error_msg),
                         "Pin %d (IO14) used for NeoPixel; call disableLeds()", pin);
                return result;
            }
            break;

        case M5IOE1_CONFIG_GPIO_INTERRUPT:
            // 检查中断互斥约束
            // Check interrupt mutex constraint
            if (_getInterruptMutexPin(pin, &mutexPin)) {
                if (_hasActiveInterrupt(mutexPin)) {
                    snprintf(result.error_msg, sizeof(result.error_msg), "Interrupt conflict: IO%d and IO%d are mutex",
                             pin + 1, mutexPin + 1);
                    result.conflicting_pin = mutexPin;
                    return result;
                }
            }
            // 检查 IO5 的 I2C 睡眠模式冲突
            // Check I2C sleep mode conflict for IO5
            if (pin == 4 && _hasI2cSleepEnabled()) {  // IO5 is pin index 4
                snprintf(result.error_msg, sizeof(result.error_msg), "IO5 interrupt disabled when I2C sleep enabled");
                return result;
            }
            break;

        case M5IOE1_CONFIG_ADC:
            // 检查引脚是否支持 ADC
            // Check if pin supports ADC
            if (!_isAdcPin(pin)) {
                snprintf(result.error_msg, sizeof(result.error_msg), "Pin %d does not support ADC", pin);
                return result;
            }
            // 检查引脚是否配置为输出
            // Check if pin is configured as output
            if (_pinStatesValid && _pinStates[pin].isOutput) {
                snprintf(result.error_msg, sizeof(result.error_msg), "Pin %d is configured as output", pin);
                return result;
            }
            break;

        case M5IOE1_CONFIG_PWM:
            // 检查引脚是否支持 PWM
            // Check if pin supports PWM
            if (!_isPwmPin(pin)) {
                snprintf(result.error_msg, sizeof(result.error_msg), "Pin %d does not support PWM", pin);
                return result;
            }
            break;

        case M5IOE1_CONFIG_NEOPIXEL:
            // NeoPixel 仅在 IO14 上工作（引脚索引 13）
            // NeoPixel only works on IO14 (pin index 13)
            if (!_isNeopixelPin(pin)) {
                snprintf(result.error_msg, sizeof(result.error_msg), "NeoPixel only supported on IO14 (pin 13)");
                return result;
            }
            // 检查引脚是否有活动中断
            // Check if pin has active interrupt
            if (_hasActiveInterrupt(pin)) {
                snprintf(result.error_msg, sizeof(result.error_msg),
                         "IO14 has active interrupt, conflicts with NeoPixel");
                return result;
            }
            // 检查中断互斥（IO10 和 IO14 是互斥的）
            // Check interrupt mutex (IO10 and IO14 are mutex)
            if (_getInterruptMutexPin(pin, &mutexPin)) {
                if (_hasActiveInterrupt(mutexPin)) {
                    snprintf(result.error_msg, sizeof(result.error_msg),
                             "IO10 has interrupt enabled, mutex with IO14 NeoPixel");
                    result.conflicting_pin = mutexPin;
                    return result;
                }
            }
            break;

        case M5IOE1_CONFIG_I2C_SLEEP:
            // I2C 睡眠模式禁用 IO5 中断
            // I2C sleep mode disables IO5 interrupt
            if (_hasActiveInterrupt(4)) {  // IO5 is pin index 4
                snprintf(result.error_msg, sizeof(result.error_msg), "I2C sleep mode will disable IO5 interrupt");
                result.conflicting_pin = 4;
                return result;
            }
            break;

        default:
            snprintf(result.error_msg, sizeof(result.error_msg), "Unknown config type");
            return result;
    }

    result.valid = true;
    return result;
}

// ============================
// 内部辅助函数
// Internal Helper Functions
// ============================

bool M5IOE1::_writeReg(uint8_t reg, uint8_t value)
{
    _checkAutoWake();
    for (int attempt = 0; attempt < M5IOE1_I2C_RETRY_COUNT; ++attempt) {
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            if (M5IOE1_M5UNIFIED_WRITE_BYTE(_m5_i2c, _addr, reg, value, _commFreq)) {
                M5IOE1_LOG_D(TAG_I2C, "Write Reg[0x%02X] <- 0x%02X", reg, value);
                return true;
            }
        } else
#endif
            if (M5IOE1_I2C_ARDUINO_WRITE_BYTE(_wire, _addr, reg, value)) {
            M5IOE1_LOG_D(TAG_I2C, "Write Reg[0x%02X] <- 0x%02X", reg, value);
            return true;
        }
#else
        bool ok = false;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                ok = (M5IOE1_I2C_MASTER_WRITE_BYTE(_i2c_master_dev, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                ok = (M5IOE1_I2C_BUS_WRITE_BYTE(_i2c_device, reg, value) == ESP_OK);
                break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY:
                ok = (M5IOE1_I2C_LEGACY_WRITE_BYTE(_port, _addr, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                ok = M5IOE1_M5UNIFIED_WRITE_BYTE(_m5_i2c, _addr, reg, value, _commFreq);
                break;
#endif
            default:
                ok = false;
                break;
        }
        if (ok) {
            M5IOE1_LOG_D(TAG_I2C, "Write Reg[0x%02X] <- 0x%02X", reg, value);
            return true;
        }
#endif
        if (attempt + 1 < M5IOE1_I2C_RETRY_COUNT) {
            M5IOE1_DELAY_MS(M5IOE1_I2C_RETRY_DELAY_MS);
        }
    }
    M5IOE1_LOG_E(TAG_I2C, "Write Reg[0x%02X] failed", reg);
    return false;
}

bool M5IOE1::_writeReg16(uint8_t reg, uint16_t value)
{
    _checkAutoWake();
    for (int attempt = 0; attempt < M5IOE1_I2C_RETRY_COUNT; ++attempt) {
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            if (M5IOE1_M5UNIFIED_WRITE_REG16(_m5_i2c, _addr, reg, value, _commFreq)) {
                M5IOE1_LOG_D(TAG_I2C, "Write16 Reg[0x%02X] <- 0x%04X", reg, value);
                return true;
            }
        } else
#endif
            if (M5IOE1_I2C_ARDUINO_WRITE_REG16(_wire, _addr, reg, value)) {
            M5IOE1_LOG_D(TAG_I2C, "Write16 Reg[0x%02X] <- 0x%04X", reg, value);
            return true;
        }
#else
        bool ok = false;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                ok = (M5IOE1_I2C_MASTER_WRITE_REG16(_i2c_master_dev, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                ok = (M5IOE1_I2C_BUS_WRITE_REG16(_i2c_device, reg, value) == ESP_OK);
                break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY:
                ok = (M5IOE1_I2C_LEGACY_WRITE_REG16(_port, _addr, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                ok = M5IOE1_M5UNIFIED_WRITE_REG16(_m5_i2c, _addr, reg, value, _commFreq);
                break;
#endif
            default:
                ok = false;
                break;
        }
        if (ok) {
            M5IOE1_LOG_D(TAG_I2C, "Write16 Reg[0x%02X] <- 0x%04X", reg, value);
            return true;
        }
#endif
        if (attempt + 1 < M5IOE1_I2C_RETRY_COUNT) {
            M5IOE1_DELAY_MS(M5IOE1_I2C_RETRY_DELAY_MS);
        }
    }
    M5IOE1_LOG_E(TAG_I2C, "Write16 Reg[0x%02X] failed", reg);
    return false;
}

