prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
bool M5IOE1::_readReg(uint8_t reg, uint8_t* value)
{
    if (value == nullptr) {
        M5IOE1_LOG_E(TAG_I2C, "Read  Reg[0x%02X] failed: null value", reg);
        return false;
    }

    _checkAutoWake();
    for (int attempt = 0; attempt < M5IOE1_I2C_RETRY_COUNT; ++attempt) {
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            if (M5IOE1_M5UNIFIED_READ_BYTE(_m5_i2c, _addr, reg, value, _commFreq)) {
                M5IOE1_LOG_D(TAG_I2C, "Read  Reg[0x%02X] -> 0x%02X", reg, *value);
                return true;
            }
        } else
#endif
            if (M5IOE1_I2C_ARDUINO_READ_BYTE(_wire, _addr, reg, value)) {
            M5IOE1_LOG_D(TAG_I2C, "Read  Reg[0x%02X] -> 0x%02X", reg, *value);
            return true;
        }
#else
        bool ok = false;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                ok = (M5IOE1_I2C_MASTER_READ_BYTE(_i2c_master_dev, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                ok = (M5IOE1_I2C_BUS_READ_BYTE(_i2c_device, reg, value) == ESP_OK);
                break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY:
                ok = (M5IOE1_I2C_LEGACY_READ_BYTE(_port, _addr, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                ok = M5IOE1_M5UNIFIED_READ_BYTE(_m5_i2c, _addr, reg, value, _commFreq);
                break;
#endif
            default:
                ok = false;
                break;
        }
        if (ok) {
            M5IOE1_LOG_D(TAG_I2C, "Read  Reg[0x%02X] -> 0x%02X", reg, *value);
            return true;
        }
#endif
        if (attempt + 1 < M5IOE1_I2C_RETRY_COUNT) {
            M5IOE1_DELAY_MS(M5IOE1_I2C_RETRY_DELAY_MS);
        }
    }
    M5IOE1_LOG_E(TAG_I2C, "Read  Reg[0x%02X] failed", reg);
    return false;
}

bool M5IOE1::_readReg16(uint8_t reg, uint16_t* value)
{
    if (value == nullptr) {
        M5IOE1_LOG_E(TAG_I2C, "Read16 Reg[0x%02X] failed: null value", reg);
        return false;
    }

    _checkAutoWake();
    for (int attempt = 0; attempt < M5IOE1_I2C_RETRY_COUNT; ++attempt) {
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            if (M5IOE1_M5UNIFIED_READ_REG16(_m5_i2c, _addr, reg, value, _commFreq)) {
                M5IOE1_LOG_D(TAG_I2C, "Read16 Reg[0x%02X] -> 0x%04X", reg, *value);
                return true;
            }
        } else
#endif
            if (M5IOE1_I2C_ARDUINO_READ_REG16(_wire, _addr, reg, value)) {
            M5IOE1_LOG_D(TAG_I2C, "Read16 Reg[0x%02X] -> 0x%04X", reg, *value);
            return true;
        }
#else
        bool ok = false;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                ok = (M5IOE1_I2C_MASTER_READ_REG16(_i2c_master_dev, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                ok = (M5IOE1_I2C_BUS_READ_REG16(_i2c_device, reg, value) == ESP_OK);
                break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY:
                ok = (M5IOE1_I2C_LEGACY_READ_REG16(_port, _addr, reg, value) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                ok = M5IOE1_M5UNIFIED_READ_REG16(_m5_i2c, _addr, reg, value, _commFreq);
                break;
#endif
            default:
                ok = false;
                break;
        }
        if (ok) {
            M5IOE1_LOG_D(TAG_I2C, "Read16 Reg[0x%02X] -> 0x%04X", reg, *value);
            return true;
        }
#endif
        if (attempt + 1 < M5IOE1_I2C_RETRY_COUNT) {
            M5IOE1_DELAY_MS(M5IOE1_I2C_RETRY_DELAY_MS);
        }
    }
    M5IOE1_LOG_E(TAG_I2C, "Read16 Reg[0x%02X] failed", reg);
    return false;
}

bool M5IOE1::_writeBytes(uint8_t reg, const uint8_t* data, uint8_t len)
{
    if (data == nullptr && len > 0) {
        M5IOE1_LOG_E(TAG_I2C, "WriteBytes Reg[0x%02X] len=%d failed: null data", reg, len);
        return false;
    }

    _checkAutoWake();
    for (int attempt = 0; attempt < M5IOE1_I2C_RETRY_COUNT; ++attempt) {
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            if (M5IOE1_M5UNIFIED_WRITE_BYTES(_m5_i2c, _addr, reg, len, data, _commFreq)) {
                M5IOE1_LOG_V(TAG_I2C, "WriteBytes Reg[0x%02X] len=%d: %02X %02X %02X...", reg, len,
                             len > 0 ? data[0] : 0, len > 1 ? data[1] : 0, len > 2 ? data[2] : 0);
                return true;
            }
        } else
#endif
            if (M5IOE1_I2C_ARDUINO_WRITE_BYTES(_wire, _addr, reg, len, data)) {
            M5IOE1_LOG_V(TAG_I2C, "WriteBytes Reg[0x%02X] len=%d: %02X %02X %02X...", reg, len, len > 0 ? data[0] : 0,
                         len > 1 ? data[1] : 0, len > 2 ? data[2] : 0);
            return true;
        }
#else
        bool ok = false;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                ok = (M5IOE1_I2C_MASTER_WRITE_BYTES(_i2c_master_dev, reg, len, data) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                ok = (M5IOE1_I2C_BUS_WRITE_BYTES(_i2c_device, reg, len, data) == ESP_OK);
                break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY:
                ok = (M5IOE1_I2C_LEGACY_WRITE_BYTES(_port, _addr, reg, len, data) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                ok = M5IOE1_M5UNIFIED_WRITE_BYTES(_m5_i2c, _addr, reg, len, data, _commFreq);
                break;
#endif
            default:
                ok = false;
                break;
        }
        if (ok) {
            M5IOE1_LOG_V(TAG_I2C, "WriteBytes Reg[0x%02X] len=%d: %02X %02X %02X...", reg, len, len > 0 ? data[0] : 0,
                         len > 1 ? data[1] : 0, len > 2 ? data[2] : 0);
            return true;
        }
#endif
        if (attempt + 1 < M5IOE1_I2C_RETRY_COUNT) {
            M5IOE1_DELAY_MS(M5IOE1_I2C_RETRY_DELAY_MS);
        }
    }
    M5IOE1_LOG_E(TAG_I2C, "WriteBytes Reg[0x%02X] len=%d failed", reg, len);
    return false;
}

bool M5IOE1::_readBytes(uint8_t reg, uint8_t* data, uint8_t len)
{
    if (data == nullptr && len > 0) {
        M5IOE1_LOG_E(TAG_I2C, "ReadBytes  Reg[0x%02X] len=%d failed: null data", reg, len);
        return false;
    }

    _checkAutoWake();
    for (int attempt = 0; attempt < M5IOE1_I2C_RETRY_COUNT; ++attempt) {
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            if (M5IOE1_M5UNIFIED_READ_BYTES(_m5_i2c, _addr, reg, len, data, _commFreq)) {
                M5IOE1_LOG_V(TAG_I2C, "ReadBytes  Reg[0x%02X] len=%d: %02X %02X %02X...", reg, len,
                             len > 0 ? data[0] : 0, len > 1 ? data[1] : 0, len > 2 ? data[2] : 0);
                return true;
            }
        } else
#endif
            if (M5IOE1_I2C_ARDUINO_READ_BYTES(_wire, _addr, reg, len, data)) {
            M5IOE1_LOG_V(TAG_I2C, "ReadBytes  Reg[0x%02X] len=%d: %02X %02X %02X...", reg, len, len > 0 ? data[0] : 0,
                         len > 1 ? data[1] : 0, len > 2 ? data[2] : 0);
            return true;
        }
#else
        bool ok = false;
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                ok = (M5IOE1_I2C_MASTER_READ_BYTES(_i2c_master_dev, reg, len, data) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                ok = (M5IOE1_I2C_BUS_READ_BYTES(_i2c_device, reg, len, data) == ESP_OK);
                break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY:
                ok = (M5IOE1_I2C_LEGACY_READ_BYTES(_port, _addr, reg, len, data) == ESP_OK);
                break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                ok = M5IOE1_M5UNIFIED_READ_BYTES(_m5_i2c, _addr, reg, len, data, _commFreq);
                break;
#endif
            default:
                ok = false;
                break;
        }
        if (ok) {
            M5IOE1_LOG_V(TAG_I2C, "ReadBytes  Reg[0x%02X] len=%d: %02X %02X %02X...", reg, len, len > 0 ? data[0] : 0,
                         len > 1 ? data[1] : 0, len > 2 ? data[2] : 0);
            return true;
        }
#endif
        if (attempt + 1 < M5IOE1_I2C_RETRY_COUNT) {
            M5IOE1_DELAY_MS(M5IOE1_I2C_RETRY_DELAY_MS);
        }
    }
    M5IOE1_LOG_E(TAG_I2C, "ReadBytes  Reg[0x%02X] len=%d failed", reg, len);
    return false;
}

bool M5IOE1::_isValidPin(uint8_t pin)
{
    return pin < M5IOE1_MAX_GPIO_PINS;
}

bool M5IOE1::_isAdcPin(uint8_t pin)
{
    // ADC 引脚：IO2(1), IO4(3), IO5(4), IO7(6)
    // ADC pins: IO2(1), IO4(3), IO5(4), IO7(6)
    return (pin == 1 || pin == 3 || pin == 4 || pin == 6);
}

