prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
bool M5IOE1::_isPwmPin(uint8_t pin)
{
    // PWM 引脚：IO8(7), IO9(8), IO10(9), IO11(10)
    // PWM pins: IO8(7), IO9(8), IO10(9), IO11(10)
    return (pin == 7 || pin == 8 || pin == 9 || pin == 10);
}

uint8_t M5IOE1::_getAdcChannel(uint8_t pin)
{
    switch (pin) {
        case 1:
            return 1;  // IO2
        case 3:
            return 2;  // IO4
        case 4:
            return 3;  // IO5
        case 6:
            return 4;  // IO7
        default:
            return 0;
    }
}

uint8_t M5IOE1::_getPwmChannel(uint8_t pin)
{
    switch (pin) {
        case 8:
            return 0;  // IO9 -> PWM1
        case 7:
            return 1;  // IO8 -> PWM2
        case 10:
            return 2;  // IO11 -> PWM3
        case 9:
            return 3;  // IO10 -> PWM4
        default:
            return 0;
    }
}

void M5IOE1::_clearPinStates()
{
    memset(_pinStates, 0, sizeof(_pinStates));
    _pinStatesValid = false;
}

void M5IOE1::_clearPwmStates()
{
    memset(_pwmStates, 0, sizeof(_pwmStates));
    _pwmFrequency   = 0;
    _pwmStatesValid = false;
}

void M5IOE1::_clearAdcState()
{
    memset(&_adcState, 0, sizeof(_adcState));
    _adcStateValid = false;
}

bool M5IOE1::_snapshotPinStates()
{
    if (!_initialized) return false;

    uint16_t modeReg = 0, outReg = 0, inReg = 0, puReg = 0, pdReg = 0, drvReg = 0, ieReg = 0, itReg = 0;

    if (!_readReg16(M5IOE1_REG_GPIO_MODE_L, &modeReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_OUT_L, &outReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_IN_L, &inReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_PU_L, &puReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_PD_L, &pdReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_DRV_L, &drvReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_IE_L, &ieReg)) return false;
    if (!_readReg16(M5IOE1_REG_GPIO_IP_L, &itReg)) return false;

    for (uint8_t pin = 0; pin < M5IOE1_MAX_GPIO_PINS; pin++) {
        _pinStates[pin].isOutput    = (modeReg & (1 << pin)) != 0;
        _pinStates[pin].outputLevel = (outReg & (1 << pin)) ? 1 : 0;
        _pinStates[pin].inputLevel  = (inReg & (1 << pin)) ? 1 : 0;
        _pinStates[pin].pull        = (puReg & (1 << pin)) ? 1 : ((pdReg & (1 << pin)) ? 2 : 0);
        _pinStates[pin].drive       = (drvReg & (1 << pin)) ? 1 : 0;
        _pinStates[pin].intrEnabled = (ieReg & (1 << pin)) != 0;
        _pinStates[pin].intrRising  = (itReg & (1 << pin)) != 0;
    }

    _pinStatesValid = true;
    return true;
}

bool M5IOE1::_snapshotPwmStates()
{
    if (!_initialized) return false;

    if (!_readReg16(M5IOE1_REG_PWM_FREQ_L, &_pwmFrequency)) return false;

    for (uint8_t ch = 0; ch < M5IOE1_MAX_PWM_CHANNELS; ch++) {
        uint8_t regL  = M5IOE1_REG_PWM1_DUTY_L + (ch * 2);
        uint16_t data = 0;
        if (!_readReg16(regL, &data)) return false;

        _pwmStates[ch].duty12   = data & 0x0FFF;
        _pwmStates[ch].enabled  = (data & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) != 0;
        _pwmStates[ch].polarity = (data & ((uint16_t)M5IOE1_PWM_POLARITY << 8)) != 0;
    }

    _pwmStatesValid = true;
    return true;
}

bool M5IOE1::_snapshotAdcState()
{
    if (!_initialized) return false;

    uint8_t ctrl = 0;
    if (!_readReg(M5IOE1_REG_ADC_CTRL, &ctrl)) return false;

    _adcState.activeChannel = ctrl & M5IOE1_ADC_CH_MASK;
    _adcState.busy          = (ctrl & M5IOE1_ADC_BUSY) != 0;

    if (!_adcState.busy) {
        if (!_readReg16(M5IOE1_REG_ADC_DATA_L, &_adcState.lastValue)) {
            _adcState.lastValue = 0;
        }
    }

    _adcStateValid = true;
    return true;
}

void M5IOE1::_autoSnapshotUpdate(uint8_t domains)
{
    if (!_autoSnapshot || !_initialized) return;

    if (domains & M5IOE1_SNAPSHOT_DOMAIN_GPIO) {
        _snapshotPinStates();
    }
    if (domains & M5IOE1_SNAPSHOT_DOMAIN_PWM) {
        _snapshotPwmStates();
    }
    if (domains & M5IOE1_SNAPSHOT_DOMAIN_ADC) {
        _snapshotAdcState();
    }
    if (domains & M5IOE1_SNAPSHOT_DOMAIN_AW8737A) {
        _snapshotAw8737a();
    }
}

bool M5IOE1::_isValidI2cFrequency(uint32_t speed)
{
    return (speed == M5IOE1_I2C_FREQ_100K || speed == M5IOE1_I2C_FREQ_400K);
}

m5ioe1_err_t M5IOE1::getI2cSpeed(m5ioe1_i2c_speed_t* speed)
{
    if (speed == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_initialized) return M5IOE1_ERR_NOT_INIT;

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) return M5IOE1_ERR_I2C_COMM;

    // 更新缓存
    // Update cache
    _i2cConfig.speed400k = (cfg & M5IOE1_I2C_SPEED_400K_BIT) != 0;
    _i2cConfigValid      = true;

    *speed = _i2cConfig.speed400k ? M5IOE1_I2C_SPEED_400K : M5IOE1_I2C_SPEED_100K;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::switchI2cSpeed(m5ioe1_i2c_speed_t speed)
{
    if (!_initialized) {
        M5IOE1_LOG_E(TAG_I2C, "Cannot switch I2C speed: device not initialized");
        return M5IOE1_ERR_NOT_INIT;
    }

    uint32_t targetFreq = (speed == M5IOE1_I2C_SPEED_400K) ? M5IOE1_I2C_FREQ_400K : M5IOE1_I2C_FREQ_100K;

    // 如果目标速度与当前速度相同，直接返回成功
    // If target speed is same as current, return success directly
    if (targetFreq == _requestedSpeed) {
        M5IOE1_LOG_I(TAG_I2C, "I2C speed already at %" PRIu32 " Hz, no change needed", targetFreq);
        return M5IOE1_OK;
    }

    // 步骤 1: 读取当前 I2C 配置
    // Step 1: Read current I2C config
    uint8_t i2cCfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &i2cCfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to read I2C config register");
        return M5IOE1_ERR_I2C_COMM;
    }

    // 步骤 2: 根据目标速度设置或清除 400KHz 模式位
    // Step 2: Set or clear 400KHz mode bit based on target speed
    if (speed == M5IOE1_I2C_SPEED_400K) {
        i2cCfg |= M5IOE1_I2C_SPEED_400K_BIT;
    } else {
        i2cCfg &= ~M5IOE1_I2C_SPEED_400K_BIT;
    }

    if (!_writeReg(M5IOE1_REG_I2C_CFG, i2cCfg)) {
        M5IOE1_LOG_E(TAG_I2C, "Failed to write I2C config register");
        return M5IOE1_ERR_I2C_COMM;
    }

    M5IOE1_LOG_D(TAG_I2C, "M5IOE1 I2C config set to %" PRIu32 " Hz mode", targetFreq);

    // 步骤 3: 短暂延迟以允许设备处理配置更改
    // Step 3: Small delay to allow device to process the configuration change
    M5IOE1_DELAY_MS(5);

    // 步骤 4: 将主机 I2C 总线切换到目标速度
    // Step 4: Switch host I2C bus to target speed
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
    if (_m5_i2c) {
        _commFreq = targetFreq;
        M5IOE1_LOG_D(TAG_I2C, "M5Unified I2C frequency updated to %" PRIu32 " Hz", targetFreq);
    } else
#endif
        if (_wire != nullptr) {
        // 必须使用 Wire.end() + Wire.begin() 在 ESP32 上正确切换 I2C 频率
        // Must use Wire.end() + Wire.begin() to properly switch I2C frequency on ESP32
        _wire->end();
        M5IOE1_DELAY_MS(10);
        if (!_wire->begin(_sda, _scl, targetFreq)) {
            M5IOE1_LOG_E(TAG_I2C, "Failed to re-initialize I2C bus at %" PRIu32 " Hz", targetFreq);
            // 尝试恢复到原来的速度
            // Try to recover with original speed
            uint32_t originalFreq = (speed == M5IOE1_I2C_SPEED_400K) ? M5IOE1_I2C_FREQ_100K : M5IOE1_I2C_FREQ_400K;
            _wire->begin(_sda, _scl, originalFreq);
            // 恢复设备配置
            // Revert device config
            if (speed == M5IOE1_I2C_SPEED_400K) {
                i2cCfg &= ~M5IOE1_I2C_SPEED_400K_BIT;
            } else {
                i2cCfg |= M5IOE1_I2C_SPEED_400K_BIT;
            }
            _writeReg(M5IOE1_REG_I2C_CFG, i2cCfg);
            return M5IOE1_ERR_I2C_CONFIG;
        }
        M5IOE1_DELAY_MS(10);
        M5IOE1_LOG_D(TAG_I2C, "Host I2C bus switched to %" PRIu32 " Hz", targetFreq);
    }
#else
    // ESP-IDF：处理不同的驱动类型
    // ESP-IDF: Handle different driver types
    esp_err_t ret;

    switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
        case M5IOE1_I2C_DRIVER_SELF_CREATED:
        case M5IOE1_I2C_DRIVER_MASTER:
            // 对于 i2c_master 驱动：删除设备并以新速度重新添加
            // For i2c_master driver: remove device and add with new speed
            if (_i2c_master_dev != nullptr) {
                ret = i2c_master_bus_rm_device(_i2c_master_dev);
                if (ret != ESP_OK) {
                    M5IOE1_LOG_E(TAG_I2C, "Failed to remove I2C device: %s", esp_err_to_name(ret));
                    return M5IOE1_ERR_I2C_CONFIG;
                }
                _i2c_master_dev = nullptr;

                // 以目标速度重新创建设备句柄
                // Recreate device handle with target speed
                i2c_device_config_t dev_config = {
                    .dev_addr_length = I2C_ADDR_BIT_LEN_7,
                    .device_address  = _addr,
                    .scl_speed_hz    = targetFreq,
                    .scl_wait_us     = 0,
                    .flags =
                        {
                            .disable_ack_check = false,
                        },
                };

                ret = i2c_master_bus_add_device(_i2c_master_bus, &dev_config, &_i2c_master_dev);
                if (ret != ESP_OK) {
                    M5IOE1_LOG_E(TAG_I2C, "Failed to add I2C device at %" PRIu32 " Hz: %s", targetFreq,
                                 esp_err_to_name(ret));
                    // 尝试恢复到原来的速度
                    // Try to recover with original speed
                    uint32_t originalFreq =
                        (speed == M5IOE1_I2C_SPEED_400K) ? M5IOE1_I2C_FREQ_100K : M5IOE1_I2C_FREQ_400K;
                    dev_config.scl_speed_hz = originalFreq;
                    i2c_master_bus_add_device(_i2c_master_bus, &dev_config, &_i2c_master_dev);
                    return M5IOE1_ERR_I2C_CONFIG;
                }
                M5IOE1_LOG_D(TAG_I2C, "I2C master device recreated at %" PRIu32 " Hz", targetFreq);
            }
            break;
#endif  // M5IOE1_HAS_I2C_MASTER

