prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
#if M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_BUS:
            // 对于 i2c_bus 驱动：删除设备并以新速度创建
            // For i2c_bus driver: delete device and create with new speed
            if (_i2c_device != nullptr) {
                ret = i2c_bus_device_delete(&_i2c_device);
                if (ret != ESP_OK) {
                    M5IOE1_LOG_E(TAG_I2C, "Failed to delete I2C device: %s", esp_err_to_name(ret));
                    return M5IOE1_ERR_I2C_CONFIG;
                }

                // 以目标速度重新创建设备句柄
                // Recreate device handle with target speed
                _i2c_device = i2c_bus_device_create(_i2c_bus, _addr, targetFreq);
                if (_i2c_device == nullptr) {
                    M5IOE1_LOG_E(TAG_I2C, "Failed to create I2C device at %" PRIu32 " Hz", targetFreq);
                    // 尝试恢复到原来的速度
                    // Try to recover with original speed
                    uint32_t originalFreq =
                        (speed == M5IOE1_I2C_SPEED_400K) ? M5IOE1_I2C_FREQ_100K : M5IOE1_I2C_FREQ_400K;
                    _i2c_device = i2c_bus_device_create(_i2c_bus, _addr, originalFreq);
                    return M5IOE1_ERR_I2C_CONFIG;
                }
                M5IOE1_LOG_D(TAG_I2C, "I2C bus device recreated at %" PRIu32 " Hz", targetFreq);
            }
            break;
#endif  // M5IOE1_HAS_I2C_BUS

#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_LEGACY: {
            i2c_config_t i2c_conf     = {};
            i2c_conf.mode             = I2C_MODE_MASTER;
            i2c_conf.sda_io_num       = _sda;
            i2c_conf.scl_io_num       = _scl;
            i2c_conf.sda_pullup_en    = GPIO_PULLUP_ENABLE;
            i2c_conf.scl_pullup_en    = GPIO_PULLUP_ENABLE;
            i2c_conf.master.clk_speed = targetFreq;
            ret                       = i2c_param_config(_port, &i2c_conf);
            if (ret != ESP_OK) {
                M5IOE1_LOG_E(TAG_I2C, "i2c_param_config failed: %s", esp_err_to_name(ret));
                return M5IOE1_ERR_I2C_CONFIG;
            }
            M5IOE1_LOG_D(TAG_I2C, "Legacy I2C reconfigured to %" PRIu32 " Hz", targetFreq);
            break;
        }
#endif  // !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS

#if M5IOE1_HAS_M5UNIFIED_I2C
        case M5IOE1_I2C_DRIVER_M5UNIFIED:
            _commFreq = targetFreq;
            M5IOE1_LOG_D(TAG_I2C, "M5Unified I2C frequency updated to %" PRIu32 " Hz", targetFreq);
            break;
#endif
        default:
            M5IOE1_LOG_E(TAG_I2C, "Unknown I2C driver type");
            return M5IOE1_ERR_INTERNAL;
    }
#endif

    // 步骤 5: 验证通信仍然有效
    // Step 5: Verify communication still works
    uint16_t uid = 0;
    if (!_readReg16(M5IOE1_REG_UID_L, &uid)) {
        M5IOE1_LOG_E(TAG_I2C, "Communication failed after switching to %" PRIu32 " Hz, reverting", targetFreq);

        // 恢复设备配置
        // Revert device config
        if (speed == M5IOE1_I2C_SPEED_400K) {
            i2cCfg &= ~M5IOE1_I2C_SPEED_400K_BIT;
        } else {
            i2cCfg |= M5IOE1_I2C_SPEED_400K_BIT;
        }
        uint32_t originalFreq = (speed == M5IOE1_I2C_SPEED_400K) ? M5IOE1_I2C_FREQ_100K : M5IOE1_I2C_FREQ_400K;

#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
        if (_m5_i2c) {
            _commFreq = originalFreq;
        } else
#endif
            if (_wire != nullptr) {
            _wire->end();
            M5IOE1_DELAY_MS(10);
            _wire->begin(_sda, _scl, originalFreq);
            M5IOE1_DELAY_MS(10);
        }
#else
        switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
            case M5IOE1_I2C_DRIVER_SELF_CREATED:
            case M5IOE1_I2C_DRIVER_MASTER:
                if (_i2c_master_dev != nullptr) {
                    i2c_master_bus_rm_device(_i2c_master_dev);
                    i2c_device_config_t dev_config = {
                        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
                        .device_address  = _addr,
                        .scl_speed_hz    = originalFreq,
                        .scl_wait_us     = 0,
                        .flags           = {.disable_ack_check = false},
                    };
                    i2c_master_bus_add_device(_i2c_master_bus, &dev_config, &_i2c_master_dev);
                }
                break;
#endif  // M5IOE1_HAS_I2C_MASTER
#if M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_BUS:
                if (_i2c_device != nullptr) {
                    i2c_bus_device_delete(&_i2c_device);
                    _i2c_device = i2c_bus_device_create(_i2c_bus, _addr, originalFreq);
                }
                break;
#endif  // M5IOE1_HAS_I2C_BUS
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
            case M5IOE1_I2C_DRIVER_LEGACY: {
                i2c_config_t i2c_conf     = {};
                i2c_conf.mode             = I2C_MODE_MASTER;
                i2c_conf.sda_io_num       = _sda;
                i2c_conf.scl_io_num       = _scl;
                i2c_conf.sda_pullup_en    = GPIO_PULLUP_ENABLE;
                i2c_conf.scl_pullup_en    = GPIO_PULLUP_ENABLE;
                i2c_conf.master.clk_speed = originalFreq;
                i2c_param_config(_port, &i2c_conf);  // best effort rollback
                break;
            }
#endif  // !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
#if M5IOE1_HAS_M5UNIFIED_I2C
            case M5IOE1_I2C_DRIVER_M5UNIFIED:
                _commFreq = originalFreq;
                break;
#endif
            default:
                break;
        }
#endif
        _writeReg(M5IOE1_REG_I2C_CFG, i2cCfg);
        return M5IOE1_ERR_I2C_COMM;
    }

    // 更新 I2C 配置缓存和请求速度
    // Update I2C config cache and requested speed
    _i2cConfig.speed400k = (speed == M5IOE1_I2C_SPEED_400K);
    _requestedSpeed      = targetFreq;

    M5IOE1_LOG_I(TAG_I2C, "Successfully switched to %" PRIu32 " Hz I2C mode", targetFreq);
    return M5IOE1_OK;
}

// ============================
// 地址候选与 REV 规则辅助实现
// Address candidate & REV rule helpers implementation
// ============================

// 地址段 <-> 允许 REV 字符列表
// Address range -> allowed REV characters (each char = one allowed revision)
const M5IOE1::m5ioe1_rev_rule_t M5IOE1::kRevRules[] = {
    {0x6F, 0x76, "A"},
    {0x4F, 0x50, "W"},
};

const M5IOE1::m5ioe1_rev_rule_t* M5IOE1::_findRevRule(uint8_t addr) const
{
    for (size_t i = 0; i < sizeof(kRevRules) / sizeof(kRevRules[0]); ++i) {
        if (addr >= kRevRules[i].start && addr <= kRevRules[i].end) {
            return &kRevRules[i];
        }
    }
    return nullptr;
}

bool M5IOE1::_isRevisionAllowed(uint8_t addr, uint8_t rev) const
{
    const m5ioe1_rev_rule_t* rule = _findRevRule(addr);
    if (!rule) return true;  // 无规则则放行
    const char* p = rule->valid_revs;
    while (*p) {
        if ((uint8_t)(*p) == rev) return true;
        ++p;
    }
    return false;
}

