prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
// 对当前已应用的 _addr 探测 REV 寄存器，不打 ERROR 日志（直接调底层读取一次）
// Probe REV register for currently applied _addr, no ERROR log (single low-level read)
M5IOE1::RevCheckResult M5IOE1::_checkAddressRevision(uint8_t addr) const
{
    // 读取一次，不走 retry
    uint8_t rev = 0;
    bool ok     = false;

#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
    if (_m5_i2c) {
        ok = M5IOE1_M5UNIFIED_READ_BYTE(_m5_i2c, addr, M5IOE1_REG_REV, &rev, _commFreq);
    } else
#endif
    {
        ok = M5IOE1_I2C_ARDUINO_READ_BYTE(_wire, addr, M5IOE1_REG_REV, &rev);
    }
#else
    switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
        case M5IOE1_I2C_DRIVER_SELF_CREATED:
        case M5IOE1_I2C_DRIVER_MASTER:
            ok = (M5IOE1_I2C_MASTER_READ_BYTE(_i2c_master_dev, M5IOE1_REG_REV, &rev) == ESP_OK);
            break;
#endif
#if M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_BUS:
            ok = (M5IOE1_I2C_BUS_READ_BYTE(_i2c_device, M5IOE1_REG_REV, &rev) == ESP_OK);
            break;
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_LEGACY:
            ok = (M5IOE1_I2C_LEGACY_READ_BYTE(_port, addr, M5IOE1_REG_REV, &rev) == ESP_OK);
            break;
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
        case M5IOE1_I2C_DRIVER_M5UNIFIED:
            ok = M5IOE1_M5UNIFIED_READ_BYTE(_m5_i2c, addr, M5IOE1_REG_REV, &rev, _commFreq);
            break;
#endif
        default:
            ok = false;
            break;
    }
#endif

    if (!ok) {
        return RevCheckResult::NO_RESPONSE;
    }

    const m5ioe1_rev_rule_t* rule = _findRevRule(addr);
    if (!rule) {
        M5IOE1_LOG_D(TAG_I2C, "Addr 0x%02X REV=0x%02X(%c), no rule -> allow", addr, rev, rev);
        return RevCheckResult::NO_RULE;
    }
    if (_isRevisionAllowed(addr, rev)) {
        M5IOE1_LOG_D(TAG_I2C, "Addr 0x%02X REV=0x%02X(%c) matched", addr, rev, rev);
        return RevCheckResult::MATCHED;
    }
    M5IOE1_LOG_W(TAG_I2C, "Addr 0x%02X REV=0x%02X(%c) not in allowed list '%s', abort", addr, rev, rev,
                 rule->valid_revs);
    return RevCheckResult::MISMATCH;
}

// 构建候选地址列表
// Build candidate address list
// 规则：
//   0xFF (AUTODETECT): 按固定序列 0x4F, 0x6F, 0x70..0x76, 0x50
//   0x6F: 如失败，兜底尝试 0x4F
//   0x4F: 如失败，兜底尝试 0x6F
//   其他: 如失败，兜底尝试 0x4F, 0x6F
uint8_t M5IOE1::_buildAddressCandidates(uint8_t requested, uint8_t* candidates)
{
    uint8_t n = 0;
    if (requested == M5IOE1_AUTODETECT_ADDR) {
        // 自动探测序列：0x4F, 0x6F, 0x70..0x76, 0x50
        // Auto-detect sequence: 0x4F, 0x6F, 0x70..0x76, 0x50
        candidates[n++] = 0x4F;
        candidates[n++] = 0x6F;
        for (uint8_t a = 0x70; a <= 0x76; ++a) candidates[n++] = a;
        candidates[n++] = 0x50;
    } else {
        // 显式地址：先放用户地址，再放兜底地址
        // Explicit address: user address first, then fallback addresses
        candidates[n++] = requested;
        if (requested == 0x6F) {
            candidates[n++] = 0x4F;
        } else if (requested == 0x4F) {
            candidates[n++] = 0x6F;
        } else {
            candidates[n++] = 0x4F;
            candidates[n++] = 0x6F;
        }
    }
    return n;
}

// 将候选地址（及速度）应用到当前驱动上下文（重建 device handle 如有必要）
// Apply candidate address and speed to current driver context (rebuild device handle if needed)
m5ioe1_err_t M5IOE1::_applyAddressToDriver(uint8_t candidate, uint32_t freqHz)
{
    _addr = candidate;
#ifdef ARDUINO
#if M5IOE1_HAS_M5UNIFIED_I2C
    if (_m5_i2c) {
        _commFreq = freqHz;
        return M5IOE1_OK;
    }
#endif
    // TwoWire: 需要重新 begin 以切换频率
    // TwoWire: need to re-begin to switch frequency
    if (_wire != nullptr) {
        _wire->end();
        M5IOE1_DELAY_MS(50);
        if (!_wire->begin(_sda, _scl, freqHz)) {
            M5IOE1_LOG_E(TAG_I2C, "Failed to re-init I2C @%" PRIu32 "Hz for addr 0x%02X", freqHz, candidate);
            return M5IOE1_ERR_I2C_CONFIG;
        }
        M5IOE1_DELAY_MS(50);
    }
    return M5IOE1_OK;
#else
    switch (_i2cDriverType) {
#if M5IOE1_HAS_I2C_MASTER
        case M5IOE1_I2C_DRIVER_SELF_CREATED:
        case M5IOE1_I2C_DRIVER_MASTER: {
            // 删除旧 device handle，以新地址和速度重新创建
            // Delete old device handle and recreate with new address and speed
            if (_i2c_master_dev) {
                i2c_master_bus_rm_device(_i2c_master_dev);
                _i2c_master_dev = nullptr;
            }
            i2c_device_config_t dev_cfg = {
                .dev_addr_length = I2C_ADDR_BIT_LEN_7,
                .device_address  = candidate,
                .scl_speed_hz    = freqHz,
                .scl_wait_us     = 0,
                .flags           = {.disable_ack_check = false},
            };
            esp_err_t ret = i2c_master_bus_add_device(_i2c_master_bus, &dev_cfg, &_i2c_master_dev);
            if (ret != ESP_OK) {
                M5IOE1_LOG_E(TAG_I2C, "Failed to add device 0x%02X @%" PRIu32 "Hz: %s", candidate, freqHz,
                             esp_err_to_name(ret));
                return M5IOE1_ERR_I2C_CONFIG;
            }
            return M5IOE1_OK;
        }
#endif
#if M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_BUS: {
            if (_i2c_device) {
                i2c_bus_device_delete(&_i2c_device);
                _i2c_device = nullptr;
            }
            _i2c_device = i2c_bus_device_create(_i2c_bus, candidate, freqHz);
            if (!_i2c_device) {
                M5IOE1_LOG_E(TAG_I2C, "Failed to create bus device 0x%02X @%" PRIu32 "Hz", candidate, freqHz);
                return M5IOE1_ERR_I2C_CONFIG;
            }
            return M5IOE1_OK;
        }
#endif
#if !M5IOE1_HAS_I2C_MASTER && !M5IOE1_HAS_I2C_BUS
        case M5IOE1_I2C_DRIVER_LEGACY: {
            // Legacy: 重新配置 I2C 参数以更新速度
            // Legacy: reconfigure I2C params to update speed
            i2c_config_t cfg     = {};
            cfg.mode             = I2C_MODE_MASTER;
            cfg.sda_io_num       = _sda;
            cfg.scl_io_num       = _scl;
            cfg.sda_pullup_en    = GPIO_PULLUP_ENABLE;
            cfg.scl_pullup_en    = GPIO_PULLUP_ENABLE;
            cfg.master.clk_speed = freqHz;
            esp_err_t r          = i2c_param_config(_port, &cfg);
            if (r != ESP_OK) {
                M5IOE1_LOG_E(TAG_I2C, "Legacy i2c_param_config failed @%" PRIu32 "Hz: %s", freqHz, esp_err_to_name(r));
                return M5IOE1_ERR_I2C_CONFIG;
            }
            return M5IOE1_OK;
        }
#endif
#if M5IOE1_HAS_M5UNIFIED_I2C
        case M5IOE1_I2C_DRIVER_M5UNIFIED:
            _commFreq = freqHz;
            return M5IOE1_OK;
#endif
        default:
            return M5IOE1_ERR_I2C_CONFIG;
    }
#endif
}

// 对单个候选地址执行完整初始化尝试（100K → 800ms → 100K → 400K）
// Full init attempt for one candidate (100K→800ms→100K→400K)
m5ioe1_err_t M5IOE1::_tryInitAtAddress(uint8_t candidate)
{
    // 以 100KHz 切换候选地址
    m5ioe1_err_t err = _applyAddressToDriver(candidate, M5IOE1_I2C_FREQ_100K);
    if (err != M5IOE1_OK) return err;

