prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    // 发送唤醒
    sendWakeSignal();
    M5IOE1_DELAY_MS(10);

    // 尝试1：100K
    if (_initDevice()) return M5IOE1_OK;

    // 尝试2：等待 800ms 后再尝试 100K
    M5IOE1_LOG_W(TAG_I2C, "Addr 0x%02X: 100K failed, waiting 800ms and retrying...", candidate);
    M5IOE1_DELAY_MS(800);
    sendWakeSignal();
    M5IOE1_DELAY_MS(10);
    if (_initDevice()) return M5IOE1_OK;

    // 尝试3：切换到 400K
    M5IOE1_LOG_W(TAG_I2C, "Addr 0x%02X: 100K retry failed, trying 400K...", candidate);
    err = _applyAddressToDriver(candidate, M5IOE1_I2C_FREQ_400K);
    if (err != M5IOE1_OK) return err;

    sendWakeSignal();
    M5IOE1_DELAY_MS(10);
    if (_initDevice()) return M5IOE1_OK;

    M5IOE1_LOG_E(TAG_I2C, "Addr 0x%02X: all attempts failed", candidate);
    return M5IOE1_ERR_I2C_COMM;
}

// 初始化成功后的收尾流程
// Post-init finalization
m5ioe1_err_t M5IOE1::_finishInit(m5ioe1_int_mode_t intMode)
{
    _initialized = true;

    // 强制配置 I2C（用户请求的频率 + 关闭休眠）
    // Force configure I2C (user requested speed + disable sleep)
    m5ioe1_i2c_speed_t targetSpeed =
        (_requestedSpeed == M5IOE1_I2C_FREQ_400K) ? M5IOE1_I2C_SPEED_400K : M5IOE1_I2C_SPEED_100K;

    m5ioe1_i2c_speed_t currentSpeed;
    if (getI2cSpeed(&currentSpeed) == M5IOE1_OK) {
        M5IOE1_LOG_I(TAG_I2C, "Current I2C speed: %s, Requested: %s",
                     (currentSpeed == M5IOE1_I2C_SPEED_400K) ? "400K" : "100K",
                     (targetSpeed == M5IOE1_I2C_SPEED_400K) ? "400K" : "100K");
    }

    if (setI2cConfig(0, targetSpeed, M5IOE1_WAKE_EDGE_FALLING, M5IOE1_PULL_ENABLED) != M5IOE1_OK) {
        M5IOE1_LOG_W(TAG_I2C, "Failed to set I2C config");
    }

#if defined(M5IOE1_HAS_M5UNIFIED_I2C) && M5IOE1_HAS_M5UNIFIED_I2C
#ifdef ARDUINO
    if (_m5_i2c) _commFreq = _requestedSpeed;
#else
    if (_i2cDriverType == M5IOE1_I2C_DRIVER_M5UNIFIED) _commFreq = _requestedSpeed;
#endif
#endif

    _snapshotPinStates();
    _snapshotPwmStates();
    _snapshotAdcState();
    _snapshotAw8737a();
    _snapshotI2cConfig();
    M5IOE1_LOG_D(TAG_I2C, "Snapshot completed (pins/pwm/adc/aw8737a/i2c)");

    M5IOE1_LOG_I(TAG_I2C, "M5IOE1 initialized at address 0x%02X (I2C: %" PRIu32 " Hz)", _addr, _requestedSpeed);

    if (intMode != M5IOE1_INT_MODE_DISABLED) {
        m5ioe1_err_t err = setInterruptMode(intMode);
        if (err != M5IOE1_OK) {
            _initialized = false;
            return err;
        }
    }
    return M5IOE1_OK;
}

// ============================
// 地址解析与初始化核心流程
// Address resolution and init core flow
// ============================
// 调用此函数前，调用方必须已完成 bus 初始化和 _requestedSpeed 设置。
// Caller must have completed bus init and set _requestedSpeed before calling this.
// 此函数负责地址探测/兜底、REV 校验、完整通信初始化、以及调用 _finishInit。
// This function handles address probe/fallback, REV validation, full comms init, and calls _finishInit.
m5ioe1_err_t M5IOE1::_resolveAndInit(uint8_t requestedAddr, m5ioe1_int_mode_t intMode)
{
    uint8_t candidates[kMaxCandidates];
    uint8_t nCandidates = _buildAddressCandidates(requestedAddr, candidates);

    bool firstCandidate = true;

    for (uint8_t i = 0; i < nCandidates; ++i) {
        uint8_t candidate = candidates[i];

        // 兜底候选（非首个候选）以及自动探测的所有候选都需要 REV 校验
        // Fallback candidates (non-first) and all auto-detect candidates need REV check
        bool needRevCheck = (!firstCandidate) || (requestedAddr == M5IOE1_AUTODETECT_ADDR);
        firstCandidate    = false;

        if (needRevCheck) {
            // 先以 100K 读取 REV。若无响应，再仅切到 400K 读取 REV。
            // Read REV first at 100K. If there is no response, try REV-only probe at 400K.
            if (_applyAddressToDriver(candidate, M5IOE1_I2C_FREQ_100K) != M5IOE1_OK) {
                continue;
            }

            RevCheckResult revResult = _checkAddressRevision(candidate);
            if (revResult == RevCheckResult::NO_RESPONSE) {
                if (_applyAddressToDriver(candidate, M5IOE1_I2C_FREQ_400K) != M5IOE1_OK) {
                    continue;
                }
                revResult = _checkAddressRevision(candidate);
            }

            if (revResult == RevCheckResult::MISMATCH) {
                // REV 不匹配：立即中止，不继续探测后续地址
                // REV mismatch: abort immediately, do not try further addresses
                M5IOE1_LOG_E(TAG_I2C, "Addr 0x%02X: REV mismatch, aborting address resolution", candidate);
                return M5IOE1_ERR_I2C_COMM;
            }
            if (revResult == RevCheckResult::NO_RESPONSE) {
                M5IOE1_LOG_D(TAG_I2C, "Addr 0x%02X: no response during REV probe, trying next", candidate);
                continue;
            }
            // MATCHED 或 NO_RULE：继续完整初始化
            M5IOE1_LOG_D(TAG_I2C, "Addr 0x%02X: REV probe passed (%s), proceeding with full init", candidate,
                         (revResult == RevCheckResult::MATCHED) ? "MATCHED" : "NO_RULE");
        } else {
            M5IOE1_LOG_D(TAG_I2C, "Addr 0x%02X: primary address, skipping REV pre-check", candidate);
        }

        // 执行完整初始化尝试（内部会以 100K 开始）
        // Perform full init attempt (starts at 100K internally)
        m5ioe1_err_t err = _tryInitAtAddress(candidate);
        if (err == M5IOE1_OK) {
            M5IOE1_LOG_I(TAG_I2C, "Device found at address 0x%02X", candidate);

            // 兜底成功：用户显式指定了地址，但通过备用地址才完成初始化
            // 明确告知用户硬件实际地址与传入参数不一致，建议修正调用方代码以避免后续维护混淆
            // Fallback success: user explicitly specified an address but init succeeded via a fallback
            // candidate. Notify the user that the hardware's actual address differs from the argument
            // and recommend updating the caller to prevent future maintenance confusion.
            if (requestedAddr != M5IOE1_AUTODETECT_ADDR && candidate != requestedAddr) {
                M5IOE1_LOG_W(TAG_I2C,
                             "[Address Fallback Notice] M5IOE1 initialization completed using a fallback address. "
                             "Requested address: 0x%02X, actual device address: 0x%02X. "
                             "Please update your initialization parameters to 0x%02X to ensure deterministic behavior "
                             "and avoid relying on the fallback mechanism.",
                             requestedAddr, candidate, candidate);
            }

