prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
            return _finishInit(intMode);
        }

        M5IOE1_LOG_W(TAG_I2C, "Addr 0x%02X: full init failed, trying next candidate", candidate);
    }

    M5IOE1_LOG_E(TAG_I2C, "No M5IOE1 device found (requested=0x%02X)", requestedAddr);
    return M5IOE1_ERR_I2C_COMM;
}

bool M5IOE1::_initDevice()
{
    // 读取设备信息以验证通信
    // Read device info to verify communication
    uint16_t uid    = 0;
    uint8_t version = 0;

    if (!_readReg16(M5IOE1_REG_UID_L, &uid)) {
        M5IOE1_LOG_E(TAG_SYS, "Failed to read device UID");
        return false;
    }

    if (!_readReg(M5IOE1_REG_REV, &version)) {
        M5IOE1_LOG_E(TAG_SYS, "Failed to read device version");
        return false;
    }

    M5IOE1_LOG_I(TAG_SYS, "Device UID: 0x%04X, FW Version: %02X(%c)", uid, version, version);
    return true;
}

void M5IOE1::_handleInterrupt()
{
    // 步骤 1: 读取一次中断状态
    // Step 1: Read interrupt status once
    uint16_t status = 0;
    if (getInterruptStatus(&status) != M5IOE1_OK) return;

    if (status == 0) return;

    // 步骤 2: 立即写入0清除所有中断（避免在处理回调期间丢失新中断）
    // Step 2: Immediately write 0 to clear all interrupts (avoid losing new interrupts during callback processing)
    _writeReg16(M5IOE1_REG_GPIO_IS_L, 0);

    // 步骤 3: 处理所有触发的引脚回调
    // Step 3: Process all triggered pin callbacks
    for (uint8_t pin = 0; pin < M5IOE1_MAX_GPIO_PINS; pin++) {
        if ((status & (1 << pin)) && _callbacks[pin].enabled) {
            if (_enableDefaultIsrLog) {
                M5IOE1_LOG_I(TAG_IRQ, "Pin %d triggered by %s edge", pin,
                             _callbacks[pin].rising ? "RISING" : "FALLING");
            }

            if (_callbacks[pin].callbackArg != nullptr) {
                _callbacks[pin].callbackArg(_callbacks[pin].arg);
            } else if (_callbacks[pin].callback != nullptr) {
                _callbacks[pin].callback();
            }
        }
    }
}

bool M5IOE1::_pinsConflict(uint8_t a, uint8_t b)
{
    // 中断冲突对（1-based IO 编号）：
    // Interrupt conflict pairs (1-based IO numbers):
    // (1,6), (2,3), (7,12), (8,9), (10,14), (11,13)
    uint8_t A = a + 1, B = b + 1;

    auto eq = [](uint8_t x, uint8_t y, uint8_t m, uint8_t n) { return (x == m && y == n) || (x == n && y == m); };

    return eq(A, B, 1, 6) || eq(A, B, 2, 3) || eq(A, B, 7, 12) || eq(A, B, 8, 9) || eq(A, B, 10, 14) ||
           eq(A, B, 11, 13);
}

bool M5IOE1::_hasConflictingInterrupt(uint8_t pin)
{
    for (uint8_t i = 0; i < M5IOE1_MAX_GPIO_PINS; i++) {
        if (i != pin && _pinStates[i].intrEnabled && _pinsConflict(pin, i)) {
            return true;
        }
    }
    return false;
}

// ============================
// 配置验证辅助函数
// Configuration Validation Helpers
// ============================

bool M5IOE1::_getInterruptMutexPin(uint8_t pin, uint8_t* mutexPin)
{
    if (mutexPin == nullptr) return false;

    // 中断互斥对（0-based 引脚索引）：
    // Interrupt mutex pairs (0-based pin indices):
    // IO1(0) <-> IO6(5)
    // IO2(1) <-> IO3(2)
    // IO7(6) <-> IO12(11)
    // IO8(7) <-> IO9(8)
    // IO10(9) <-> IO14(13)
    // IO11(10) <-> IO13(12)

    static const uint8_t mutexPairs[][2] = {
        {0, 5},   // IO1 <-> IO6
        {1, 2},   // IO2 <-> IO3
        {6, 11},  // IO7 <-> IO12
        {7, 8},   // IO8 <-> IO9
        {9, 13},  // IO10 <-> IO14
        {10, 12}  // IO11 <-> IO13
    };

    for (size_t i = 0; i < sizeof(mutexPairs) / sizeof(mutexPairs[0]); i++) {
        if (pin == mutexPairs[i][0]) {
            *mutexPin = mutexPairs[i][1];
            return true;
        }
        if (pin == mutexPairs[i][1]) {
            *mutexPin = mutexPairs[i][0];
            return true;
        }
    }

    return false;
}

bool M5IOE1::_isNeopixelPin(uint8_t pin)
{
    // NeoPixel LED 功能仅在 IO14 上可用（引脚索引 13）
    // NeoPixel LED function only available on IO14 (pin index 13)
    return (pin == 13);
}

bool M5IOE1::_hasActiveInterrupt(uint8_t pin)
{
    if (!_isValidPin(pin)) return false;
    if (!_pinStatesValid) return false;
    return _pinStates[pin].intrEnabled;
}

bool M5IOE1::_hasActiveAdc(uint8_t pin)
{
    if (!_isAdcPin(pin)) return false;
    if (!_adcStateValid) return false;

    // 检查 ADC 当前是否正在使用此引脚的通道
    // Check if the ADC is currently using this pin's channel
    uint8_t channel = _getAdcChannel(pin);
    return (_adcState.activeChannel == channel);
}

bool M5IOE1::_hasActivePwm(uint8_t pin)
{
    if (!_isPwmPin(pin)) return false;
    if (!_pwmStatesValid) return false;

    uint8_t channel = _getPwmChannel(pin);
    return _pwmStates[channel].enabled;
}

bool M5IOE1::_hasI2cSleepEnabled()
{
    if (!_i2cConfigValid) return false;
    return (_i2cConfig.sleepTime > 0);
}

bool M5IOE1::_isLedEnabled()
{
    // 直接读取 LED_CFG 寄存器
    // Read LED_CFG register directly
    uint8_t ledCfg = 0;
    if (!_readReg(M5IOE1_REG_LED_CFG, &ledCfg)) {
        return false;
    }
    uint8_t ledCount = ledCfg & M5IOE1_LED_NUM_MASK;
    return (ledCount > 0);
}

// ============================
// I2C 配置快照
// I2C Config Snapshot
// ============================

void M5IOE1::_clearI2cConfig()
{
    memset(&_i2cConfig, 0, sizeof(_i2cConfig));
    _i2cConfigValid = false;
}

bool M5IOE1::_snapshotI2cConfig()
{
    if (!_initialized) return false;

    uint8_t cfg = 0;
    if (!_readReg(M5IOE1_REG_I2C_CFG, &cfg)) return false;

    _i2cConfig.sleepTime  = cfg & M5IOE1_I2C_SLEEP_MASK;
    _i2cConfig.speed400k  = (cfg & M5IOE1_I2C_SPEED_400K_BIT) != 0;
    _i2cConfig.wakeRising = (cfg & M5IOE1_I2C_WAKE_RISING) != 0;
    _i2cConfig.pullOff    = (cfg & M5IOE1_I2C_PULL_OFF) != 0;
    _i2cConfigValid       = true;

    return true;
}

bool M5IOE1::_snapshotAw8737a()
{
    if (!_initialized) return false;

    uint8_t regValue = 0;
    if (!_readReg(M5IOE1_REG_AW8737A_PULSE, &regValue)) {
        M5IOE1_LOG_E(TAG_AMP, "Failed to read AW8737A pulse register");
        _aw8737aStateValid = false;
        return false;
    }

    // 解析寄存器值（不含 REFRESH 位）
    // Parse register value (without REFRESH bit)
    _aw8737aRegValue   = regValue & 0x7F;
    _aw8737aPin        = regValue & M5IOE1_AW8737A_GPIO_MASK;
    _aw8737aPulseNum   = (m5ioe1_aw8737a_pulse_t)((regValue >> M5IOE1_AW8737A_NUM_SHIFT) & M5IOE1_AW8737A_NUM_MASK);
    _aw8737aStateValid = true;

