prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
    return true;
}

void M5IOE1::_clearAw8737a()
{
    _aw8737aConfigured = false;
    _aw8737aPin        = 0;
    _aw8737aPulseNum   = M5IOE1_AW8737A_PULSE_0;
    _aw8737aRegValue   = 0;
    _aw8737aStateValid = false;
}

// ============================
// 快照验证
// Snapshot Verification
// ============================

m5ioe1_snapshot_verify_t M5IOE1::verifySnapshot()
{
    m5ioe1_snapshot_verify_t result = {};
    result.consistent               = true;

    if (!_initialized) {
        result.consistent = false;
        return result;
    }

    // 验证 GPIO 寄存器
    // Verify GPIO registers
    if (_pinStatesValid) {
        uint16_t actualMode = 0, actualOutput = 0;

        if (_readReg16(M5IOE1_REG_GPIO_MODE_L, &actualMode) && _readReg16(M5IOE1_REG_GPIO_OUT_L, &actualOutput)) {
            // 从缓存构建期望值
            // Build expected values from cache
            uint16_t expectedMode = 0, expectedOutput = 0;
            for (uint8_t i = 0; i < M5IOE1_MAX_GPIO_PINS; i++) {
                if (_pinStates[i].isOutput) {
                    expectedMode |= (1 << i);
                }
                if (_pinStates[i].outputLevel) {
                    expectedOutput |= (1 << i);
                }
            }

            result.expected_mode   = expectedMode;
            result.actual_mode     = actualMode;
            result.expected_output = expectedOutput;
            result.actual_output   = actualOutput;

            if (expectedMode != actualMode || expectedOutput != actualOutput) {
                result.gpio_mismatch = true;
                result.consistent    = false;
            }
        } else {
            result.consistent = false;
        }
    }

    // 验证 PWM 寄存器
    // Verify PWM registers
    if (_pwmStatesValid) {
        uint16_t actualFreq = 0;
        if (_readReg16(M5IOE1_REG_PWM_FREQ_L, &actualFreq)) {
            if (actualFreq != _pwmFrequency) {
                result.pwm_mismatch = true;
                result.consistent   = false;
            }
        }

        for (uint8_t ch = 0; ch < M5IOE1_MAX_PWM_CHANNELS; ch++) {
            uint8_t regL  = M5IOE1_REG_PWM1_DUTY_L + (ch * 2);
            uint16_t data = 0;
            if (_readReg16(regL, &data)) {
                uint16_t actualDuty = data & 0x0FFF;
                bool actualEnabled  = (data & ((uint16_t)M5IOE1_PWM_ENABLE << 8)) != 0;
                bool actualPolarity = (data & ((uint16_t)M5IOE1_PWM_POLARITY << 8)) != 0;

                if (actualDuty != _pwmStates[ch].duty12 || actualEnabled != _pwmStates[ch].enabled ||
                    actualPolarity != _pwmStates[ch].polarity) {
                    result.pwm_mismatch = true;
                    result.consistent   = false;
                }
            }
        }
    }

    // 验证 ADC 寄存器
    // Verify ADC registers
    if (_adcStateValid) {
        uint8_t ctrl = 0;
        if (_readReg(M5IOE1_REG_ADC_CTRL, &ctrl)) {
            uint8_t actualChannel = ctrl & M5IOE1_ADC_CH_MASK;
            if (actualChannel != _adcState.activeChannel) {
                result.adc_mismatch = true;
                result.consistent   = false;
            }
        }
    }

    // 验证 AW8737A 寄存器
    // Verify AW8737A registers
    if (_aw8737aStateValid) {
        uint8_t actualReg = 0;
        if (_readReg(M5IOE1_REG_AW8737A_PULSE, &actualReg)) {
            result.expected_aw8737a = _aw8737aRegValue;
            result.actual_aw8737a   = actualReg & 0x7F;

            if (result.expected_aw8737a != result.actual_aw8737a) {
                result.aw8737a_mismatch = true;
                result.consistent       = false;
            }
        } else {
            result.consistent = false;
        }
    }

    return result;
}

// ============================
// 缓存状态查询函数
// Cached State Query Functions
// ============================

m5ioe1_err_t M5IOE1::getCachedPwmFrequency(uint16_t* frequency)
{
    if (frequency == nullptr) return M5IOE1_ERR_INVALID_ARG;
    if (!_pwmStatesValid) return M5IOE1_FAIL;
    *frequency = _pwmFrequency;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getCachedPwmState(uint8_t channel, uint16_t* duty12, bool* polarity, bool* enabled)
{
    if (channel > 3 || duty12 == nullptr || polarity == nullptr || enabled == nullptr) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_pwmStatesValid) return M5IOE1_FAIL;

    *duty12   = _pwmStates[channel].duty12;
    *polarity = _pwmStates[channel].polarity;
    *enabled  = _pwmStates[channel].enabled;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getCachedAdcState(uint8_t* activeChannel, bool* busy, uint16_t* lastValue)
{
    if (activeChannel == nullptr || busy == nullptr || lastValue == nullptr) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_adcStateValid) return M5IOE1_FAIL;

    *activeChannel = _adcState.activeChannel;
    *busy          = _adcState.busy;
    *lastValue     = _adcState.lastValue;
    return M5IOE1_OK;
}

m5ioe1_err_t M5IOE1::getCachedPinState(uint8_t pin, bool* isOutput, uint8_t* level, uint8_t* pull)
{
    if (!_isValidPin(pin) || isOutput == nullptr || level == nullptr || pull == nullptr) {
        return M5IOE1_ERR_INVALID_ARG;
    }
    if (!_pinStatesValid) return M5IOE1_FAIL;

    *isOutput = _pinStates[pin].isOutput;
    *level    = _pinStates[pin].isOutput ? _pinStates[pin].outputLevel : _pinStates[pin].inputLevel;
    *pull     = _pinStates[pin].pull;
    return M5IOE1_OK;
}

// ============================
// 平台特定函数
// Platform-Specific Functions
// ============================

#ifdef ARDUINO

void IRAM_ATTR M5IOE1::_arduinoIsrHandler(void* arg)
{
    M5IOE1* self = static_cast<M5IOE1*>(arg);
    if (self == nullptr || self->_pollTask == nullptr) {
        return;
    }
    BaseType_t hpw = pdFALSE;
    vTaskNotifyGiveFromISR(self->_pollTask, &hpw);
    if (hpw == pdTRUE) {
        portYIELD_FROM_ISR();
    }
}

void M5IOE1::_pollTaskArduino(void* arg)
{
    M5IOE1* self = static_cast<M5IOE1*>(arg);

    while (true) {
        uint16_t status = 0;
        if (self->getInterruptStatus(&status) == M5IOE1_OK && status != 0) {
            self->_handleInterrupt();
        }
        vTaskDelay(pdMS_TO_TICKS(self->_pollingInterval));
    }
}

bool M5IOE1::_setupPollingArduino()
{
    BaseType_t ok = xTaskCreatePinnedToCore(_pollTaskArduino, "m5ioe1_poll", 4096, this, 5, &_pollTask, tskNO_AFFINITY);
    return ok == pdPASS;
}

