prodigylinda/ESP32_deskdog_ROM/managed_components/m5stack__m5ioe1/src/M5IOE1.cpp
void M5IOE1::_cleanupPollingArduino()
{
    if (_pollTask) {
        vTaskDelete(_pollTask);
        _pollTask = nullptr;
    }
}

void M5IOE1::_intrTaskArduino(void* arg)
{
    M5IOE1* self = static_cast<M5IOE1*>(arg);
    while (true) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        if (self) {
            self->_handleInterrupt();
        }
    }
}

bool M5IOE1::_setupHardwareInterruptArduino()
{
    if (_intPin < 0) {
        M5IOE1_LOG_E(TAG_IRQ, "Hardware interrupt mode requires interrupt pin");
        return false;
    }

    pinMode(_intPin, INPUT_PULLUP);

    BaseType_t ok = xTaskCreatePinnedToCore(_intrTaskArduino, "m5ioe1_intr", 4096, this, 5, &_pollTask, tskNO_AFFINITY);
    if (ok != pdPASS) {
        _pollTask = nullptr;
        return false;
    }

    attachInterruptArg(digitalPinToInterrupt(_intPin), _arduinoIsrHandler, this, FALLING);
    return true;
}

void M5IOE1::_cleanupHardwareInterruptArduino()
{
    if (_intPin >= 0) {
        detachInterrupt(_intPin);
    }
    if (_pollTask) {
        vTaskDelete(_pollTask);
        _pollTask = nullptr;
    }
}

#else  // ESP-IDF

void M5IOE1::_pollTaskFunc(void* arg)
{
    M5IOE1* self = static_cast<M5IOE1*>(arg);

    while (true) {
        uint16_t status = 0;
        if (self->getInterruptStatus(&status) == M5IOE1_OK && status != 0) {
            self->_handleInterrupt();
        }
        vTaskDelay(pdMS_TO_TICKS(self->_pollingInterval));
    }
}

void IRAM_ATTR M5IOE1::_isrHandler(void* arg)
{
    M5IOE1* self = static_cast<M5IOE1*>(arg);
    if (self && self->_intrQueue) {
        // 立即禁用中断，防止电平触发造成 ISR 风暴
        // Disable interrupt immediately to prevent level-triggered ISR storm
        gpio_intr_disable((gpio_num_t)self->_intPin);
        uint32_t evt   = 1;
        BaseType_t hpw = pdFALSE;
        xQueueSendFromISR(self->_intrQueue, &evt, &hpw);
        if (hpw == pdTRUE) portYIELD_FROM_ISR();
    }
}

bool M5IOE1::_setupHardwareInterrupt()
{
    if (_intPin < 0) {
        M5IOE1_LOG_E(TAG_IRQ, "Hardware interrupt mode requires interrupt pin");
        return false;
    }

    _intrQueue = xQueueCreate(8, sizeof(uint32_t));
    if (_intrQueue == nullptr) return false;

    gpio_config_t io_conf = {};
    io_conf.pin_bit_mask  = (1ULL << _intPin);
    io_conf.mode          = GPIO_MODE_INPUT;
    io_conf.pull_up_en    = GPIO_PULLUP_ENABLE;
    io_conf.pull_down_en  = GPIO_PULLDOWN_DISABLE;
    io_conf.intr_type     = GPIO_INTR_LOW_LEVEL;

    if (gpio_config(&io_conf) != ESP_OK) {
        vQueueDelete(_intrQueue);
        _intrQueue = nullptr;
        return false;
    }

    esp_err_t isr_err = gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
    if (isr_err != ESP_OK && isr_err != ESP_ERR_INVALID_STATE) {
        vQueueDelete(_intrQueue);
        _intrQueue = nullptr;
        return false;
    }

    if (gpio_isr_handler_add((gpio_num_t)_intPin, _isrHandler, this) != ESP_OK) {
        vQueueDelete(_intrQueue);
        _intrQueue = nullptr;
        return false;
    }

    // 创建任务以处理中断
    // Create task to handle interrupts
    BaseType_t ok = xTaskCreatePinnedToCore(
        [](void* arg) {
            M5IOE1* self = static_cast<M5IOE1*>(arg);
            uint32_t evt;
            while (true) {
                if (xQueueReceive(self->_intrQueue, &evt, portMAX_DELAY) == pdTRUE) {
                    gpio_intr_disable((gpio_num_t)self->_intPin);
                    self->_handleInterrupt();
                    gpio_intr_enable((gpio_num_t)self->_intPin);
                }
            }
        },
        "m5ioe1_intr", 4096, this, configMAX_PRIORITIES - 2, &_pollTask, tskNO_AFFINITY);

    if (ok != pdPASS) {
        gpio_isr_handler_remove((gpio_num_t)_intPin);
        vQueueDelete(_intrQueue);
        _intrQueue = nullptr;
        return false;
    }

    return true;
}

bool M5IOE1::_setupPolling()
{
    BaseType_t ok = xTaskCreatePinnedToCore(_pollTaskFunc, "m5ioe1_poll", 4096, this, 5, &_pollTask, tskNO_AFFINITY);
    return ok == pdPASS;
}

void M5IOE1::_cleanupPolling()
{
    if (_pollTask) {
        vTaskDelete(_pollTask);
        _pollTask = nullptr;
    }
}

void M5IOE1::_cleanupHardwareInterrupt()
{
    if (_intrQueue) {
        vQueueDelete(_intrQueue);
        _intrQueue = nullptr;
    }
    if (_intPin >= 0) {
        // 移除 GPIO ISR handler
        // Remove GPIO ISR handler
        // 如果返回错误（如"GPIO isr service is not installed"）可忽略
        // The returned error (e.g., "GPIO isr service is not installed") can be ignored
        // This error indicates that the ISR service is not currently installed and does not need to be removed, which
        // is expected behavior
        esp_err_t err = gpio_isr_handler_remove((gpio_num_t)_intPin);
        if (err != ESP_OK) {
            M5IOE1_LOG_W(TAG_IRQ,
                         "gpio_isr_handler_remove failed (can be ignored if ISR service was not installed): %s",
                         esp_err_to_name(err));
        }
    }
}

#endif
